[
  {
    "url": "https://en.itu.dk/Programmes/Student-Life/Practical-information-for-international-students#main",
    "title": "Practical information for international students",
    "headings": [
      {
        "level": "h1",
        "text": "Practical information for international students"
      },
      {
        "level": "h2",
        "text": "Housing"
      },
      {
        "level": "h2",
        "text": "Residence Permit"
      },
      {
        "level": "h2",
        "text": "Living in Denmark"
      },
      {
        "level": "h3",
        "text": "Who are the dorms for?"
      },
      {
        "level": "h3",
        "text": "The renting period"
      },
      {
        "level": "h3",
        "text": "The residence halls"
      },
      {
        "level": "h3",
        "text": "Signalhuset (28 dorms)"
      },
      {
        "level": "h3",
        "text": "Tietgenkollegiet (4 dorms)"
      },
      {
        "level": "h3",
        "text": "Øresundskollegiet (9 dorms: 5 single - 4 double)"
      },
      {
        "level": "h3",
        "text": "Application process"
      },
      {
        "level": "h3",
        "text": "Applications for Spring 2026:"
      },
      {
        "level": "h3",
        "text": "EU/EEA students"
      },
      {
        "level": "h3",
        "text": "Non-EU/EEA students"
      },
      {
        "level": "h3",
        "text": "Application process"
      },
      {
        "level": "h3",
        "text": "Insurance"
      },
      {
        "level": "h3",
        "text": "Living expenses"
      }
    ],
    "paragraphs": [
      "We offer housing to all inbound exchange students (not for Summer University exchange students) and some international full degree students during their first or/and second semester of studies on a 'first come - first served' basis. Enrolment at ITU is a precondition for renting a dorm room, but you are able to apply for housing while waiting for an answer to your admission application for one of ITU's study programmes.",
      "The semester accommodation periods are as follows:",
      "In general, international first semester full degree students are able to rent the dorm for 2 semesters (from 15 July to 14 July next year). Alternatively, we offer you 1 semester with possibility to extend the renting period with an additional semester.",
      "The dorm rooms are of similar standard and distance to the IT University and the city is easily manageable by bike and/or public transport. We have 37 single rooms and 4 dorm rooms for couples. Only the student renting the dorm must be an ITU student. All of the dorms are fully furnished. See the list of residence halls below.",
      "SignalhusetSignalhuset (28 dorms) Signalhuset is located in the area in Amager called Ørestad and is within walking distance to the metro from where you can easily get to central Copenhagen. It is a modern hall of residence built in 2006. Signalhuset is divided into sections which resembles individual apartments. Each section consists of 4 single rooms which each share 2 bathrooms and 1 kitchen/small common area. The apartments are mixed gender. The hall of residence has elevators and a laundry mat. There is also a room which can be rented for social events. The monthly rent varies from 3771 to 4029 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about the Signalhuset on the web page of Housing Foundation Copenhagen.TietgenkollegietTietgenkollegiet (4 dorms) Tietgenkollegiet was ready for the first students to move in at the end of August 2006. Tietgenkollegiet is located in Amager, in an upcoming area with several new student halls and the Amager Campus of University of Copenhagen. You are close to both the inner city and to Amager beach with a view to Sweden. The building consists of 6 floors and contains 360 rooms and the residence is fitted with elevators. The rooms are single rooms with private bathroom and shared kitchens. There is one kitchen per 12 rooms. Please note, at Tietgenkollegiet you are expected to become a part of the community and to participate in the social life of the residence hall. The montly rent varies from 4650 to 4984 DDK. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Tietgenkollegiet on the web page of Housing Foundation Copenhagen. ØresundskollegietØresundskollegiet (9 dorms: 5 single - 4 double) Øresundskollegiet is one of the largest student residences in Copenhagen with approximately 1025 rooms. The single rooms have private kitchen and bathroom. The rooms for couples also have a living room. The residence has several facilities such as a pool table, table tennis, study rooms, exercise equipment and sauna as well as terraces and a bar. There is also a common kitchen on each floor. The montly rent varies from 3828 to 3878 DDK plus 250 DDK in service fee for the single dorms. The monthly rent for the double dorms varies from 6220 to 6798 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Øresundskollegiet on the web page of Housing Foundation Copenhagen.",
      "Signalhuset is located in the area in Amager called Ørestad and is within walking distance to the metro from where you can easily get to central Copenhagen. It is a modern hall of residence built in 2006. Signalhuset is divided into sections which resembles individual apartments. Each section consists of 4 single rooms which each share 2 bathrooms and 1 kitchen/small common area. The apartments are mixed gender. The hall of residence has elevators and a laundry mat. There is also a room which can be rented for social events.",
      "The monthly rent varies from 3771 to 4029 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK.",
      "You can read about the Signalhuset on the web page of Housing Foundation Copenhagen.",
      "Tietgenkollegiet was ready for the first students to move in at the end of August 2006. Tietgenkollegiet is located in Amager, in an upcoming area with several new student halls and the Amager Campus of University of Copenhagen. You are close to both the inner city and to Amager beach with a view to Sweden. The building consists of 6 floors and contains 360 rooms and the residence is fitted with elevators. The rooms are single rooms with private bathroom and shared kitchens. There is one kitchen per 12 rooms. Please note, at Tietgenkollegiet you are expected to become a part of the community and to participate in the social life of the residence hall.",
      "The montly rent varies from 4650 to 4984 DDK. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK.",
      "You can read about Tietgenkollegiet on the web page of Housing Foundation Copenhagen.",
      "Øresundskollegiet is one of the largest student residences in Copenhagen with approximately 1025 rooms. The single rooms have private kitchen and bathroom. The rooms for couples also have a living room. The residence has several facilities such as a pool table, table tennis, study rooms, exercise equipment and sauna as well as terraces and a bar. There is also a common kitchen on each floor.",
      "The montly rent varies from 3828 to 3878 DDK plus 250 DDK in service fee for the single dorms. The monthly rent for the double dorms varies from 6220 to 6798 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK.",
      "You can read about Øresundskollegiet on the web page of Housing Foundation Copenhagen.",
      "Exchange students apply for housing along with the application for exchange, and full degree students apply on a 'first come, first serve' basis within the following deadlines:",
      "NB: Housing in Autumn 2025 is now fully booked - we have ed all students we were able to offer housing.",
      "NB: If we are able to offer you housing, you will receive further information about the booking process and an invitation to the booking system from Housing Foundation Copenhagen.",
      "All exchange students need to get an EU residence permit. EU/EEA students can get this after arrival.",
      "Non-EU students must apply for a residence permit to stay in Denmark for more than three months. Please note, if your home country has a visa requirement you must obtain the residence permit to enter Denmark. If you are a citizen of a visa-free country, you can enter Denmark without the residence permit, if you have not received your residence permit prior to your arrival to Denmark. You will find the list of countries with visa requirement and visa-free countries on the web page of New to Denmark.",
      "The IT University will assist you with information about the application process for the residence permit. Normally, the processing time is up to 2 months. You can have an overview of the process on the web page of New to Denmark. On the web page of the Ministry of Foreign Affairs of Denmark you will see where to have your biometric features recorded. Before you start up the process, please make sure that your passport is valid during your stay in Denmark.",
      "You will automatically receive Danish Health Insurance when you are staying in Denmark for a period longer than three months, via the National Danish Security Number (CPR). This gives you the right to free medical treatment by doctors and in hospitals. Dental treatment and home transportation is not included. You must have a third party liability insurance and a home insurance to cover your personal belongings.",
      "Non-EU students: Please be aware that the Danish health insurance does not cover you during your first six weeks.",
      "Living expenses in Copenhagen are on average 6.500 DKK per month/ app. 870€/ app. 745£ / app. 960 $ (exchange rate November 2019).",
      "For more information about living and studying in Denmark:",
      "If you have questions about administrative issues such as your enrolment, registration for courses and applications, please  Student Affairs and Programmes.",
      "Find our opening hours here",
      "If you have questions about the study programmes at the IT University, please  The Study and Career Guidance.",
      "Find our opening hours here",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
      "The spring semester: 1 February to 14 July (it is possible to extend to 31 August)",
      "The autumn semester: 15 July to 31 January",
      "The spring semester: 1 November",
      "The autumn semester: 1 June",
      "For new applications, please fill out this form. Please notice, if you are applying for enrolment at a BSc or MSc programme at ITU, we cannot offer you housing until we know the admission results. Once the admission results are final and you have accepted your offer, we will  you if there are still available rooms for you to book.",
      "Please notice, if you are applying for enrolment at a BSc or MSc programme at ITU, we cannot offer you housing until we know the admission results. Once the admission results are final and you have accepted your offer, we will  you if there are still available rooms for you to book.",
      "For students applying for extension of their current housing, please fill out this form.",
      "Study in Denmark",
      "E-mail: sap@itu.dk",
      "Phone: +45 7218 5405",
      "E-mail: studentadvisors@itu.dk",
      "Phone: +45 7218 5440",
      ": .com/studyandcareer"
    ],
    "links": [],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Practical information for international students Practical information for international students Housing Residence Permit Living in Denmark Who are the dorms for? The renting period The residence halls Signalhuset (28 dorms) Tietgenkollegiet (4 dorms) Øresundskollegiet (9 dorms: 5 single - 4 double) Application process Applications for Spring 2026: EU/EEA students Non-EU/EEA students Application process Insurance Living expenses We offer housing to all inbound exchange students (not for Summer University exchange students) and some international full degree students during their first or/and second semester of studies on a 'first come - first served' basis. Enrolment at ITU is a precondition for renting a dorm room, but you are able to apply for housing while waiting for an answer to your admission application for one of ITU's study programmes. The semester accommodation periods are as follows: In general, international first semester full degree students are able to rent the dorm for 2 semesters (from 15 July to 14 July next year). Alternatively, we offer you 1 semester with possibility to extend the renting period with an additional semester. The dorm rooms are of similar standard and distance to the IT University and the city is easily manageable by bike and/or public transport. We have 37 single rooms and 4 dorm rooms for couples. Only the student renting the dorm must be an ITU student. All of the dorms are fully furnished. See the list of residence halls below. SignalhusetSignalhuset (28 dorms) Signalhuset is located in the area in Amager called Ørestad and is within walking distance to the metro from where you can easily get to central Copenhagen. It is a modern hall of residence built in 2006. Signalhuset is divided into sections which resembles individual apartments. Each section consists of 4 single rooms which each share 2 bathrooms and 1 kitchen/small common area. The apartments are mixed gender. The hall of residence has elevators and a laundry mat. There is also a room which can be rented for social events. The monthly rent varies from 3771 to 4029 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about the Signalhuset on the web page of Housing Foundation Copenhagen.TietgenkollegietTietgenkollegiet (4 dorms) Tietgenkollegiet was ready for the first students to move in at the end of August 2006. Tietgenkollegiet is located in Amager, in an upcoming area with several new student halls and the Amager Campus of University of Copenhagen. You are close to both the inner city and to Amager beach with a view to Sweden. The building consists of 6 floors and contains 360 rooms and the residence is fitted with elevators. The rooms are single rooms with private bathroom and shared kitchens. There is one kitchen per 12 rooms. Please note, at Tietgenkollegiet you are expected to become a part of the community and to participate in the social life of the residence hall. The montly rent varies from 4650 to 4984 DDK. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Tietgenkollegiet on the web page of Housing Foundation Copenhagen. ØresundskollegietØresundskollegiet (9 dorms: 5 single - 4 double) Øresundskollegiet is one of the largest student residences in Copenhagen with approximately 1025 rooms. The single rooms have private kitchen and bathroom. The rooms for couples also have a living room. The residence has several facilities such as a pool table, table tennis, study rooms, exercise equipment and sauna as well as terraces and a bar. There is also a common kitchen on each floor. The montly rent varies from 3828 to 3878 DDK plus 250 DDK in service fee for the single dorms. The monthly rent for the double dorms varies from 6220 to 6798 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Øresundskollegiet on the web page of Housing Foundation Copenhagen. Signalhuset is located in the area in Amager called Ørestad and is within walking distance to the metro from where you can easily get to central Copenhagen. It is a modern hall of residence built in 2006. Signalhuset is divided into sections which resembles individual apartments. Each section consists of 4 single rooms which each share 2 bathrooms and 1 kitchen/small common area. The apartments are mixed gender. The hall of residence has elevators and a laundry mat. There is also a room which can be rented for social events. The monthly rent varies from 3771 to 4029 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about the Signalhuset on the web page of Housing Foundation Copenhagen. Tietgenkollegiet was ready for the first students to move in at the end of August 2006. Tietgenkollegiet is located in Amager, in an upcoming area with several new student halls and the Amager Campus of University of Copenhagen. You are close to both the inner city and to Amager beach with a view to Sweden. The building consists of 6 floors and contains 360 rooms and the residence is fitted with elevators. The rooms are single rooms with private bathroom and shared kitchens. There is one kitchen per 12 rooms. Please note, at Tietgenkollegiet you are expected to become a part of the community and to participate in the social life of the residence hall. The montly rent varies from 4650 to 4984 DDK. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Tietgenkollegiet on the web page of Housing Foundation Copenhagen. Øresundskollegiet is one of the largest student residences in Copenhagen with approximately 1025 rooms. The single rooms have private kitchen and bathroom. The rooms for couples also have a living room. The residence has several facilities such as a pool table, table tennis, study rooms, exercise equipment and sauna as well as terraces and a bar. There is also a common kitchen on each floor. The montly rent varies from 3828 to 3878 DDK plus 250 DDK in service fee for the single dorms. The monthly rent for the double dorms varies from 6220 to 6798 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Øresundskollegiet on the web page of Housing Foundation Copenhagen. Exchange students apply for housing along with the application for exchange, and full degree students apply on a 'first come, first serve' basis within the following deadlines: NB: Housing in Autumn 2025 is now fully booked - we have ed all students we were able to offer housing. NB: If we are able to offer you housing, you will receive further information about the booking process and an invitation to the booking system from Housing Foundation Copenhagen. All exchange students need to get an EU residence permit. EU/EEA students can get this after arrival. Non-EU students must apply for a residence permit to stay in Denmark for more than three months. Please note, if your home country has a visa requirement you must obtain the residence permit to enter Denmark. If you are a citizen of a visa-free country, you can enter Denmark without the residence permit, if you have not received your residence permit prior to your arrival to Denmark. You will find the list of countries with visa requirement and visa-free countries on the web page of New to Denmark. The IT University will assist you with information about the application process for the residence permit. Normally, the processing time is up to 2 months. You can have an overview of the process on the web page of New to Denmark. On the web page of the Ministry of Foreign Affairs of Denmark you will see where to have your biometric features recorded. Before you start up the process, please make sure that your passport is valid during your stay in Denmark. You will automatically receive Danish Health Insurance when you are staying in Denmark for a period longer than three months, via the National Danish Security Number (CPR). This gives you the right to free medical treatment by doctors and in hospitals. Dental treatment and home transportation is not included. You must have a third party liability insurance and a home insurance to cover your personal belongings. Non-EU students: Please be aware that the Danish health insurance does not cover you during your first six weeks. Living expenses in Copenhagen are on average 6.500 DKK per month/ app. 870€/ app. 745£ / app. 960 $ (exchange rate November 2019). For more information about living and studying in Denmark: If you have questions about administrative issues such as your enrolment, registration for courses and applications, please Student Affairs and Programmes. Find our opening hours here If you have questions about the study programmes at the IT University, please The Study and Career Guidance. Find our opening hours here This page is printed from https://www.itu.dk/om-itu/bygning/find-vej The spring semester: 1 February to 14 July (it is possible to extend to 31 August) The autumn semester: 15 July to 31 January The spring semester: 1 November The autumn semester: 1 June For new applications, please fill out this form. Please notice, if you are applying for enrolment at a BSc or MSc programme at ITU, we cannot offer you housing until we know the admission results. Once the admission results are final and you have accepted your offer, we will you if there are still available rooms for you to book. Please notice, if you are applying for enrolment at a BSc or MSc programme at ITU, we cannot offer you housing until we know the admission results. Once the admission results are final and you have accepted your offer, we will you if there are still available rooms for you to book. For students applying for extension of their current housing, please fill out this form. Study in Denmark E-mail: sap@itu.dk Phone: +45 7218 5405 E-mail: studentadvisors@itu.dk Phone: +45 7218 5440 : .com/studyandcareer",
    "word_count": 1713
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/How-to-apply-to-become-exchange-student",
    "title": "How to apply",
    "headings": [
      {
        "level": "h1",
        "text": "How to apply"
      },
      {
        "level": "h2",
        "text": "On this page you find the information necessary to apply to become an exchange student at ITU"
      },
      {
        "level": "h2",
        "text": "Application step by step"
      },
      {
        "level": "h2",
        "text": "English language proficiency requirement"
      }
    ],
    "paragraphs": [
      "Application deadlinesAutumn semester - end of August to Januar Nomination deadline: 15 April Application deadline: 1 May Spring semester - end of January to June Nomination deadline: 15 October Application deadline: 1 November Summer University - July to August Nomination deadline: 1 April Application deadline: 15 April You have to prepare the following application documents for your exchange application:",
      "Autumn semester - end of August to Januar",
      "Nomination deadline: 15 April Application deadline: 1 May",
      "Spring semester - end of January to June",
      "Nomination deadline: 15 October Application deadline: 1 November",
      "Summer University - July to August",
      "Nomination deadline: 1 April Application deadline: 15 April",
      "How to meet and document the English language proficiency requirement:",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
      "ITU pre-approval of credit transfer",
      "Online Learning Agreement (for Erasmus+ students only)",
      "Transcript of records (incl. BSc diploma if you apply for MSc courses)",
      "Documentation for English language proficiency",
      "Scan of passport (photo page)",
      "Your home university sends us your nomination (we need your name, email address, date of birth (dd-mm-yyyy), gender, citizenship and level of studies: BSc/MSc)",
      "We start up your application in our application portal and guide you on how to apply via the system",
      "You apply within the application deadline",
      "We confirm your application",
      "You receive a Letter of Acceptance including information about the Introduction Day, course registration, housing and residence permit (for non EU-citizens)",
      "We inform you about result of your course selection",
      "You receive a welcoming email with information about your study start",
      "Finally we welcome you on the Introduction Day at ITU",
      "You hold an upper secondary school certificate or a BSc degree that has been fully taught in English from USA, Canada, Australia, New Zealand, England, Scotland or Ireland",
      "You are enrolled in BSc or MSc degree fully taught in English",
      "You are a native speaker of English",
      "For ERASMUS students only: You have achieved the minimum result of B2 in the Online Linguistic Support (OLS)",
      "You have achieved the minimum result in one of the following English language proficiency tests: IELTS Academic Test: minimum result of 6.5 TOEFL iBT: minimum result of 88 Cambridge Certificate of Advanced English (CAE): passed Cambridge Certificate of Proficiency in English (CPE): passed NB: The test result cannot be more than 2 years old (please note, time limitation does not apply to CPE and CAE).",
      "IELTS Academic Test: minimum result of 6.5",
      "TOEFL iBT: minimum result of 88",
      "Cambridge Certificate of Advanced English (CAE): passed",
      "Cambridge Certificate of Proficiency in English (CPE): passed",
      "NB: The test result cannot be more than 2 years old (please note, time limitation does not apply to CPE and CAE)."
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students",
        "text": "Exchange students"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "Exchange student at IT-University of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/Preapproval-of-credit-transfer--151118-pdf.pdf",
        "text": "ITU pre-approval of credit transfer"
      }
    ],
    "metadata": {
      "description": "On this page you find the information necessary to apply to become an exchange student at ITU"
    },
    "full_text": "How to apply How to apply On this page you find the information necessary to apply to become an exchange student at ITU Application step by step English language proficiency requirement Application deadlinesAutumn semester - end of August to Januar Nomination deadline: 15 April Application deadline: 1 May Spring semester - end of January to June Nomination deadline: 15 October Application deadline: 1 November Summer University - July to August Nomination deadline: 1 April Application deadline: 15 April You have to prepare the following application documents for your exchange application: Autumn semester - end of August to Januar Nomination deadline: 15 April Application deadline: 1 May Spring semester - end of January to June Nomination deadline: 15 October Application deadline: 1 November Summer University - July to August Nomination deadline: 1 April Application deadline: 15 April How to meet and document the English language proficiency requirement: This page is printed from https://www.itu.dk/om-itu/bygning/find-vej ITU pre-approval of credit transfer Online Learning Agreement (for Erasmus+ students only) Transcript of records (incl. BSc diploma if you apply for MSc courses) Documentation for English language proficiency Scan of passport (photo page) Your home university sends us your nomination (we need your name, email address, date of birth (dd-mm-yyyy), gender, citizenship and level of studies: BSc/MSc) We start up your application in our application portal and guide you on how to apply via the system You apply within the application deadline We confirm your application You receive a Letter of Acceptance including information about the Introduction Day, course registration, housing and residence permit (for non EU-citizens) We inform you about result of your course selection You receive a welcoming email with information about your study start Finally we welcome you on the Introduction Day at ITU You hold an upper secondary school certificate or a BSc degree that has been fully taught in English from USA, Canada, Australia, New Zealand, England, Scotland or Ireland You are enrolled in BSc or MSc degree fully taught in English You are a native speaker of English For ERASMUS students only: You have achieved the minimum result of B2 in the Online Linguistic Support (OLS) You have achieved the minimum result in one of the following English language proficiency tests: IELTS Academic Test: minimum result of 6.5 TOEFL iBT: minimum result of 88 Cambridge Certificate of Advanced English (CAE): passed Cambridge Certificate of Proficiency in English (CPE): passed NB: The test result cannot be more than 2 years old (please note, time limitation does not apply to CPE and CAE). IELTS Academic Test: minimum result of 6.5 TOEFL iBT: minimum result of 88 Cambridge Certificate of Advanced English (CAE): passed Cambridge Certificate of Proficiency in English (CPE): passed NB: The test result cannot be more than 2 years old (please note, time limitation does not apply to CPE and CAE).",
    "word_count": 470
  },
  {
    "url": "https://en.itu.dk/Programmes/Student-Life/Practical-information-for-international-students",
    "title": "Practical information for international students",
    "headings": [
      {
        "level": "h1",
        "text": "Practical information for international students"
      },
      {
        "level": "h2",
        "text": "Housing"
      },
      {
        "level": "h2",
        "text": "Residence Permit"
      },
      {
        "level": "h2",
        "text": "Living in Denmark"
      },
      {
        "level": "h3",
        "text": "Who are the dorms for?"
      },
      {
        "level": "h3",
        "text": "The renting period"
      },
      {
        "level": "h3",
        "text": "The residence halls"
      },
      {
        "level": "h3",
        "text": "Signalhuset (28 dorms)"
      },
      {
        "level": "h3",
        "text": "Tietgenkollegiet (4 dorms)"
      },
      {
        "level": "h3",
        "text": "Øresundskollegiet (9 dorms: 5 single - 4 double)"
      },
      {
        "level": "h3",
        "text": "Application process"
      },
      {
        "level": "h3",
        "text": "Applications for Spring 2026:"
      },
      {
        "level": "h3",
        "text": "EU/EEA students"
      },
      {
        "level": "h3",
        "text": "Non-EU/EEA students"
      },
      {
        "level": "h3",
        "text": "Application process"
      },
      {
        "level": "h3",
        "text": "Insurance"
      },
      {
        "level": "h3",
        "text": "Living expenses"
      }
    ],
    "paragraphs": [
      "We offer housing to all inbound exchange students (not for Summer University exchange students) and some international full degree students during their first or/and second semester of studies on a 'first come - first served' basis. Enrolment at ITU is a precondition for renting a dorm room, but you are able to apply for housing while waiting for an answer to your admission application for one of ITU's study programmes.",
      "The semester accommodation periods are as follows:",
      "In general, international first semester full degree students are able to rent the dorm for 2 semesters (from 15 July to 14 July next year). Alternatively, we offer you 1 semester with possibility to extend the renting period with an additional semester.",
      "The dorm rooms are of similar standard and distance to the IT University and the city is easily manageable by bike and/or public transport. We have 37 single rooms and 4 dorm rooms for couples. Only the student renting the dorm must be an ITU student. All of the dorms are fully furnished. See the list of residence halls below.",
      "SignalhusetSignalhuset (28 dorms) Signalhuset is located in the area in Amager called Ørestad and is within walking distance to the metro from where you can easily get to central Copenhagen. It is a modern hall of residence built in 2006. Signalhuset is divided into sections which resembles individual apartments. Each section consists of 4 single rooms which each share 2 bathrooms and 1 kitchen/small common area. The apartments are mixed gender. The hall of residence has elevators and a laundry mat. There is also a room which can be rented for social events. The monthly rent varies from 3771 to 4029 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about the Signalhuset on the web page of Housing Foundation Copenhagen.TietgenkollegietTietgenkollegiet (4 dorms) Tietgenkollegiet was ready for the first students to move in at the end of August 2006. Tietgenkollegiet is located in Amager, in an upcoming area with several new student halls and the Amager Campus of University of Copenhagen. You are close to both the inner city and to Amager beach with a view to Sweden. The building consists of 6 floors and contains 360 rooms and the residence is fitted with elevators. The rooms are single rooms with private bathroom and shared kitchens. There is one kitchen per 12 rooms. Please note, at Tietgenkollegiet you are expected to become a part of the community and to participate in the social life of the residence hall. The montly rent varies from 4650 to 4984 DDK. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Tietgenkollegiet on the web page of Housing Foundation Copenhagen. ØresundskollegietØresundskollegiet (9 dorms: 5 single - 4 double) Øresundskollegiet is one of the largest student residences in Copenhagen with approximately 1025 rooms. The single rooms have private kitchen and bathroom. The rooms for couples also have a living room. The residence has several facilities such as a pool table, table tennis, study rooms, exercise equipment and sauna as well as terraces and a bar. There is also a common kitchen on each floor. The montly rent varies from 3828 to 3878 DDK plus 250 DDK in service fee for the single dorms. The monthly rent for the double dorms varies from 6220 to 6798 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Øresundskollegiet on the web page of Housing Foundation Copenhagen.",
      "Signalhuset is located in the area in Amager called Ørestad and is within walking distance to the metro from where you can easily get to central Copenhagen. It is a modern hall of residence built in 2006. Signalhuset is divided into sections which resembles individual apartments. Each section consists of 4 single rooms which each share 2 bathrooms and 1 kitchen/small common area. The apartments are mixed gender. The hall of residence has elevators and a laundry mat. There is also a room which can be rented for social events.",
      "The monthly rent varies from 3771 to 4029 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK.",
      "You can read about the Signalhuset on the web page of Housing Foundation Copenhagen.",
      "Tietgenkollegiet was ready for the first students to move in at the end of August 2006. Tietgenkollegiet is located in Amager, in an upcoming area with several new student halls and the Amager Campus of University of Copenhagen. You are close to both the inner city and to Amager beach with a view to Sweden. The building consists of 6 floors and contains 360 rooms and the residence is fitted with elevators. The rooms are single rooms with private bathroom and shared kitchens. There is one kitchen per 12 rooms. Please note, at Tietgenkollegiet you are expected to become a part of the community and to participate in the social life of the residence hall.",
      "The montly rent varies from 4650 to 4984 DDK. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK.",
      "You can read about Tietgenkollegiet on the web page of Housing Foundation Copenhagen.",
      "Øresundskollegiet is one of the largest student residences in Copenhagen with approximately 1025 rooms. The single rooms have private kitchen and bathroom. The rooms for couples also have a living room. The residence has several facilities such as a pool table, table tennis, study rooms, exercise equipment and sauna as well as terraces and a bar. There is also a common kitchen on each floor.",
      "The montly rent varies from 3828 to 3878 DDK plus 250 DDK in service fee for the single dorms. The monthly rent for the double dorms varies from 6220 to 6798 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK.",
      "You can read about Øresundskollegiet on the web page of Housing Foundation Copenhagen.",
      "Exchange students apply for housing along with the application for exchange, and full degree students apply on a 'first come, first serve' basis within the following deadlines:",
      "NB: Housing in Autumn 2025 is now fully booked - we have ed all students we were able to offer housing.",
      "NB: If we are able to offer you housing, you will receive further information about the booking process and an invitation to the booking system from Housing Foundation Copenhagen.",
      "All exchange students need to get an EU residence permit. EU/EEA students can get this after arrival.",
      "Non-EU students must apply for a residence permit to stay in Denmark for more than three months. Please note, if your home country has a visa requirement you must obtain the residence permit to enter Denmark. If you are a citizen of a visa-free country, you can enter Denmark without the residence permit, if you have not received your residence permit prior to your arrival to Denmark. You will find the list of countries with visa requirement and visa-free countries on the web page of New to Denmark.",
      "The IT University will assist you with information about the application process for the residence permit. Normally, the processing time is up to 2 months. You can have an overview of the process on the web page of New to Denmark. On the web page of the Ministry of Foreign Affairs of Denmark you will see where to have your biometric features recorded. Before you start up the process, please make sure that your passport is valid during your stay in Denmark.",
      "You will automatically receive Danish Health Insurance when you are staying in Denmark for a period longer than three months, via the National Danish Security Number (CPR). This gives you the right to free medical treatment by doctors and in hospitals. Dental treatment and home transportation is not included. You must have a third party liability insurance and a home insurance to cover your personal belongings.",
      "Non-EU students: Please be aware that the Danish health insurance does not cover you during your first six weeks.",
      "Living expenses in Copenhagen are on average 6.500 DKK per month/ app. 870€/ app. 745£ / app. 960 $ (exchange rate November 2019).",
      "For more information about living and studying in Denmark:",
      "If you have questions about administrative issues such as your enrolment, registration for courses and applications, please  Student Affairs and Programmes.",
      "Find our opening hours here",
      "If you have questions about the study programmes at the IT University, please  The Study and Career Guidance.",
      "Find our opening hours here",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
      "The spring semester: 1 February to 14 July (it is possible to extend to 31 August)",
      "The autumn semester: 15 July to 31 January",
      "The spring semester: 1 November",
      "The autumn semester: 1 June",
      "For new applications, please fill out this form. Please notice, if you are applying for enrolment at a BSc or MSc programme at ITU, we cannot offer you housing until we know the admission results. Once the admission results are final and you have accepted your offer, we will  you if there are still available rooms for you to book.",
      "Please notice, if you are applying for enrolment at a BSc or MSc programme at ITU, we cannot offer you housing until we know the admission results. Once the admission results are final and you have accepted your offer, we will  you if there are still available rooms for you to book.",
      "For students applying for extension of their current housing, please fill out this form.",
      "Study in Denmark",
      "E-mail: sap@itu.dk",
      "Phone: +45 7218 5405",
      "E-mail: studentadvisors@itu.dk",
      "Phone: +45 7218 5440",
      ": .com/studyandcareer"
    ],
    "links": [],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Practical information for international students Practical information for international students Housing Residence Permit Living in Denmark Who are the dorms for? The renting period The residence halls Signalhuset (28 dorms) Tietgenkollegiet (4 dorms) Øresundskollegiet (9 dorms: 5 single - 4 double) Application process Applications for Spring 2026: EU/EEA students Non-EU/EEA students Application process Insurance Living expenses We offer housing to all inbound exchange students (not for Summer University exchange students) and some international full degree students during their first or/and second semester of studies on a 'first come - first served' basis. Enrolment at ITU is a precondition for renting a dorm room, but you are able to apply for housing while waiting for an answer to your admission application for one of ITU's study programmes. The semester accommodation periods are as follows: In general, international first semester full degree students are able to rent the dorm for 2 semesters (from 15 July to 14 July next year). Alternatively, we offer you 1 semester with possibility to extend the renting period with an additional semester. The dorm rooms are of similar standard and distance to the IT University and the city is easily manageable by bike and/or public transport. We have 37 single rooms and 4 dorm rooms for couples. Only the student renting the dorm must be an ITU student. All of the dorms are fully furnished. See the list of residence halls below. SignalhusetSignalhuset (28 dorms) Signalhuset is located in the area in Amager called Ørestad and is within walking distance to the metro from where you can easily get to central Copenhagen. It is a modern hall of residence built in 2006. Signalhuset is divided into sections which resembles individual apartments. Each section consists of 4 single rooms which each share 2 bathrooms and 1 kitchen/small common area. The apartments are mixed gender. The hall of residence has elevators and a laundry mat. There is also a room which can be rented for social events. The monthly rent varies from 3771 to 4029 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about the Signalhuset on the web page of Housing Foundation Copenhagen.TietgenkollegietTietgenkollegiet (4 dorms) Tietgenkollegiet was ready for the first students to move in at the end of August 2006. Tietgenkollegiet is located in Amager, in an upcoming area with several new student halls and the Amager Campus of University of Copenhagen. You are close to both the inner city and to Amager beach with a view to Sweden. The building consists of 6 floors and contains 360 rooms and the residence is fitted with elevators. The rooms are single rooms with private bathroom and shared kitchens. There is one kitchen per 12 rooms. Please note, at Tietgenkollegiet you are expected to become a part of the community and to participate in the social life of the residence hall. The montly rent varies from 4650 to 4984 DDK. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Tietgenkollegiet on the web page of Housing Foundation Copenhagen. ØresundskollegietØresundskollegiet (9 dorms: 5 single - 4 double) Øresundskollegiet is one of the largest student residences in Copenhagen with approximately 1025 rooms. The single rooms have private kitchen and bathroom. The rooms for couples also have a living room. The residence has several facilities such as a pool table, table tennis, study rooms, exercise equipment and sauna as well as terraces and a bar. There is also a common kitchen on each floor. The montly rent varies from 3828 to 3878 DDK plus 250 DDK in service fee for the single dorms. The monthly rent for the double dorms varies from 6220 to 6798 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Øresundskollegiet on the web page of Housing Foundation Copenhagen. Signalhuset is located in the area in Amager called Ørestad and is within walking distance to the metro from where you can easily get to central Copenhagen. It is a modern hall of residence built in 2006. Signalhuset is divided into sections which resembles individual apartments. Each section consists of 4 single rooms which each share 2 bathrooms and 1 kitchen/small common area. The apartments are mixed gender. The hall of residence has elevators and a laundry mat. There is also a room which can be rented for social events. The monthly rent varies from 3771 to 4029 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about the Signalhuset on the web page of Housing Foundation Copenhagen. Tietgenkollegiet was ready for the first students to move in at the end of August 2006. Tietgenkollegiet is located in Amager, in an upcoming area with several new student halls and the Amager Campus of University of Copenhagen. You are close to both the inner city and to Amager beach with a view to Sweden. The building consists of 6 floors and contains 360 rooms and the residence is fitted with elevators. The rooms are single rooms with private bathroom and shared kitchens. There is one kitchen per 12 rooms. Please note, at Tietgenkollegiet you are expected to become a part of the community and to participate in the social life of the residence hall. The montly rent varies from 4650 to 4984 DDK. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Tietgenkollegiet on the web page of Housing Foundation Copenhagen. Øresundskollegiet is one of the largest student residences in Copenhagen with approximately 1025 rooms. The single rooms have private kitchen and bathroom. The rooms for couples also have a living room. The residence has several facilities such as a pool table, table tennis, study rooms, exercise equipment and sauna as well as terraces and a bar. There is also a common kitchen on each floor. The montly rent varies from 3828 to 3878 DDK plus 250 DDK in service fee for the single dorms. The monthly rent for the double dorms varies from 6220 to 6798 DDK plus 250 DDK in service fee. Administration and handling fee is paid once per semester to Housing Foundation Copenhagen. The fee is 6950 DDK. You can read about Øresundskollegiet on the web page of Housing Foundation Copenhagen. Exchange students apply for housing along with the application for exchange, and full degree students apply on a 'first come, first serve' basis within the following deadlines: NB: Housing in Autumn 2025 is now fully booked - we have ed all students we were able to offer housing. NB: If we are able to offer you housing, you will receive further information about the booking process and an invitation to the booking system from Housing Foundation Copenhagen. All exchange students need to get an EU residence permit. EU/EEA students can get this after arrival. Non-EU students must apply for a residence permit to stay in Denmark for more than three months. Please note, if your home country has a visa requirement you must obtain the residence permit to enter Denmark. If you are a citizen of a visa-free country, you can enter Denmark without the residence permit, if you have not received your residence permit prior to your arrival to Denmark. You will find the list of countries with visa requirement and visa-free countries on the web page of New to Denmark. The IT University will assist you with information about the application process for the residence permit. Normally, the processing time is up to 2 months. You can have an overview of the process on the web page of New to Denmark. On the web page of the Ministry of Foreign Affairs of Denmark you will see where to have your biometric features recorded. Before you start up the process, please make sure that your passport is valid during your stay in Denmark. You will automatically receive Danish Health Insurance when you are staying in Denmark for a period longer than three months, via the National Danish Security Number (CPR). This gives you the right to free medical treatment by doctors and in hospitals. Dental treatment and home transportation is not included. You must have a third party liability insurance and a home insurance to cover your personal belongings. Non-EU students: Please be aware that the Danish health insurance does not cover you during your first six weeks. Living expenses in Copenhagen are on average 6.500 DKK per month/ app. 870€/ app. 745£ / app. 960 $ (exchange rate November 2019). For more information about living and studying in Denmark: If you have questions about administrative issues such as your enrolment, registration for courses and applications, please Student Affairs and Programmes. Find our opening hours here If you have questions about the study programmes at the IT University, please The Study and Career Guidance. Find our opening hours here This page is printed from https://www.itu.dk/om-itu/bygning/find-vej The spring semester: 1 February to 14 July (it is possible to extend to 31 August) The autumn semester: 15 July to 31 January The spring semester: 1 November The autumn semester: 1 June For new applications, please fill out this form. Please notice, if you are applying for enrolment at a BSc or MSc programme at ITU, we cannot offer you housing until we know the admission results. Once the admission results are final and you have accepted your offer, we will you if there are still available rooms for you to book. Please notice, if you are applying for enrolment at a BSc or MSc programme at ITU, we cannot offer you housing until we know the admission results. Once the admission results are final and you have accepted your offer, we will you if there are still available rooms for you to book. For students applying for extension of their current housing, please fill out this form. Study in Denmark E-mail: sap@itu.dk Phone: +45 7218 5405 E-mail: studentadvisors@itu.dk Phone: +45 7218 5440 : .com/studyandcareer",
    "word_count": 1713
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Erasmus-policy-statement",
    "title": "Erasmus Policy Statement By The IT University Of Copenhagen",
    "headings": [
      {
        "level": "h1",
        "text": "Erasmus Policy Statement By The IT University Of Copenhagen"
      }
    ],
    "paragraphs": [
      "The vision of the IT University of Copenhagen (ITU) is to create and share knowledge that is profound and leads to ground-breaking information technology and services for the benefit of humanity. This vision requires the university to deliver international leading teaching and re to be exceptionally good at creating value with IT. The ITU is an innovative, globally active university that focuses on carrying out teaching and re of the highest quality for attracting and providing the world with talent, who can make a difference in the world of today and tomorrow. External engagement has a central role in the overall strategy of the university where it is described as both a means to achieve world class teaching and re and a means to engage a global network into the university’s existing close collaboration with its Danish stakeholders. Engaging in externally funded re projects involving external partners is thus considered one of the main means to achieve the university’s overall objectives. Therefore, a high number of re projects at the university are conducted in collaboration with external partners locally and globally – be it private, public or NGOs – which in turn have a direct or indirect influence on local, regional, and global development. To be able to do so means engaging with a network of global relations in a meaningful and constructive way and include funding from the Erasmus+ Programme as well as other external funding.",
      "A core strategic focus for the ITU is to deliver re which addresses societal challenges and provides solutions that can lead to new insight and ways of using IT for the benefit of humanity. IT is widely regarded as an indispensable driver of change, innovation, and economic growth, and digital technology and the ITU will contribute significantly to solving the global challenges of the future, be it health, climate, or economic challenges. By offering study programmes within this area or engaging external partners in re activities, ITU can help provide society with civically engaged citizens who can contribute to a sustainable future with IT solutions. Managing the university’s changing network of global relations in a constructive way and ensuring that the ITU’s re and study programmes are attuned to the globalised context of which they are a part are also key success factors in the university’s re, educational programmes, and related strategies. Engaging in the Programme supports this vision to a high degree. The ITU focuses on developing a network which is truly global, i.e. it must not be limited to the parts of the world that have hitherto set the agenda for IT teaching and re.",
      "The ITU focuses on educating not only students but also facilitates the life-long learning of staff to develop key skills for a changing world and university sector. The ITU believes that it is highly relevant and beneficial to engage in the staff teaching and training activities that the Erasmus+ Programme provides alongside the opportunities the ITU offers. As the Erasmus+ Programme supports the goal of achieving a high level of digitalisation so is digitalisation at the core of all activities at the ITU. We believe that carrying out activities that lead to ground-breaking information technologies or services requires collaboration between people who hold different perspectives on IT. The university’s interdisciplinary approach permeates the re activities as well as in the design of the educational programmes. Digitalisation is also a goal for administrative departments for optimising work processes and being agile in an ever-changing world. Reaching the goal of internationally leading teaching and re necessitates close collaboration in a multitude of ways with relevant external partners. Thus, participating in the Programme’s project activities is a central part of the ITU’s overall internationalisation strategy. Working with mobility of faculty and students as well as with other and more encompassing types of cross-border cooperation is considered both a natural and a necessary means to achieve many of the university’s strategic objectives, both within re and education. ITU believes that mobility of talent is important when striving for excellence. Therefore, the ITU plans to continue supporting existing partnerships and developing new cooperation with partners in the EU and non-EU countries, including partnerships which focus on joint teaching and educational activities. The ITU also plans to continue to promote and support student and staff mobility and recognises and communicates the importance of theinternationally related activities for both students and staff. To further build the ITU’s portfolio of academically relevant, high quality partners, new partners must be carefully selected. The ITU focuses on various criteria, depending on the type and objective of the collaboration. When choosing partners, the main selection criterion is the academic match in the subjectmatter as well as quality. Given the ITU’s interdisciplinary approach to IT education and re, it is ofhigh priority to find partners who either share this interdisciplinary approach or who have specificcomplementary qualities relative to the ITU’s study programmes. Furthermore, the university paysspecial attention to developing a number of strategic partnerships with select universities, with whom theuniversity collaborates closely in a range of re areas as well as education and exchange. The ITU focuses on developing a truly global network of partners. Thus, the university is continuously developing new and maintaining existing partnerships within the European area and other Western countries, but there is also a focus on developing stronger relations with partners in other areas that at are perceived to be of key importance to the re and teaching conducted at the ITU. The goal is a geographically diverse selection of exchange possibilities for each of our study programmes. The most important target groups for the ITU’s mobility activities are the 1st and 2nd cycle students at the university, as effort is needed to achieve increased mobility for these target groups and ensure academically relevant exchange possibilities for them. The ITU offers high quality support and counselling for incoming and outgoing exchange students with the objective of ensuring the best possible student experience from beginning to end, academically as well as socially. The university has a central administrative department handling, among others, international mobility and is positioned together.",
      "The impact of engaging in the Erasmus+ Programme and in projects is building new knowledge, to foster dialogue and common values, and being able to disseminate valuable knowledge and learning experiences to other educational institutions as well as societies. Indicators of success are, among others, additional external funding, and an increase in the number of publications the university produces. These areas have a high strategic priority for the university. The ITU has succeeded in making 100 % of re articles and re produced at the university freely available and for the benefit of people, society, businesses etc. When looking at how the ITU’s participation in the Programme has an impact on individuals outside of the university, it is important to mention our students' employability. Educating students with competences sought after in the local and global labour market is of high priority for the university and it is important that students are agile and obtain both transferable and inter-cultural skills. Cross-border cooperation and mobility of staff and students are initiatives that not only foster quality in teaching and learning but spending a semester or a shorter re stay abroad will also improve the students' employability in an ever-changing world that becomes more and more globalised. Increasing student and staff mobility is thus a high focus for the university during the Programme period. At ITU, each study programme has a global competence profile unique to that individual study programme. The global competence profile describes which global competences a graduate has obtained as part of their studies at ITU. At ITU, global competences are most often obtained through a mix of exchange programmes and learning activities – onsite, online, or blended – to give the graduates a varied and relevant set of competences. Engaging in the Programme activities is therefore a key element in supporting and framing the quality of internationalisation activities and competences in the university’s educational programmes. The ITU aims at offering free high-quality support and counselling for all incoming and outgoing exchange students and staff with the objective of ensuring the best possible student and staff experience from beginning to end, academically as well as socially. Participant reports are key indicators for reaching this goal.",
      "You can also download the Code of Conduct (UK)",
      "You can also download the Code of Conduct (DK)",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej"
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students",
        "text": "Exchange students"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "Exchange student at IT-University of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/CoC-FINAL-som-på-ufm-dk-EN-pdf.pdf",
        "text": "You can also download the Code of Conduct (UK)"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/CoC-FINAL-som-lanceret-på-ufm-dk-pdf.pdf",
        "text": "You can also download the Code of Conduct (DK)"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/Ersamus-Charter-ITU_2021-pdf.pdf",
        "text": "The Erasmus Charter"
      }
    ],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Erasmus Policy Statement By The IT University Of Copenhagen Erasmus Policy Statement By The IT University Of Copenhagen The vision of the IT University of Copenhagen (ITU) is to create and share knowledge that is profound and leads to ground-breaking information technology and services for the benefit of humanity. This vision requires the university to deliver international leading teaching and re to be exceptionally good at creating value with IT. The ITU is an innovative, globally active university that focuses on carrying out teaching and re of the highest quality for attracting and providing the world with talent, who can make a difference in the world of today and tomorrow. External engagement has a central role in the overall strategy of the university where it is described as both a means to achieve world class teaching and re and a means to engage a global network into the university’s existing close collaboration with its Danish stakeholders. Engaging in externally funded re projects involving external partners is thus considered one of the main means to achieve the university’s overall objectives. Therefore, a high number of re projects at the university are conducted in collaboration with external partners locally and globally – be it private, public or NGOs – which in turn have a direct or indirect influence on local, regional, and global development. To be able to do so means engaging with a network of global relations in a meaningful and constructive way and include funding from the Erasmus+ Programme as well as other external funding. A core strategic focus for the ITU is to deliver re which addresses societal challenges and provides solutions that can lead to new insight and ways of using IT for the benefit of humanity. IT is widely regarded as an indispensable driver of change, innovation, and economic growth, and digital technology and the ITU will contribute significantly to solving the global challenges of the future, be it health, climate, or economic challenges. By offering study programmes within this area or engaging external partners in re activities, ITU can help provide society with civically engaged citizens who can contribute to a sustainable future with IT solutions. Managing the university’s changing network of global relations in a constructive way and ensuring that the ITU’s re and study programmes are attuned to the globalised context of which they are a part are also key success factors in the university’s re, educational programmes, and related strategies. Engaging in the Programme supports this vision to a high degree. The ITU focuses on developing a network which is truly global, i.e. it must not be limited to the parts of the world that have hitherto set the agenda for IT teaching and re. The ITU focuses on educating not only students but also facilitates the life-long learning of staff to develop key skills for a changing world and university sector. The ITU believes that it is highly relevant and beneficial to engage in the staff teaching and training activities that the Erasmus+ Programme provides alongside the opportunities the ITU offers. As the Erasmus+ Programme supports the goal of achieving a high level of digitalisation so is digitalisation at the core of all activities at the ITU. We believe that carrying out activities that lead to ground-breaking information technologies or services requires collaboration between people who hold different perspectives on IT. The university’s interdisciplinary approach permeates the re activities as well as in the design of the educational programmes. Digitalisation is also a goal for administrative departments for optimising work processes and being agile in an ever-changing world. Reaching the goal of internationally leading teaching and re necessitates close collaboration in a multitude of ways with relevant external partners. Thus, participating in the Programme’s project activities is a central part of the ITU’s overall internationalisation strategy. Working with mobility of faculty and students as well as with other and more encompassing types of cross-border cooperation is considered both a natural and a necessary means to achieve many of the university’s strategic objectives, both within re and education. ITU believes that mobility of talent is important when striving for excellence. Therefore, the ITU plans to continue supporting existing partnerships and developing new cooperation with partners in the EU and non-EU countries, including partnerships which focus on joint teaching and educational activities. The ITU also plans to continue to promote and support student and staff mobility and recognises and communicates the importance of theinternationally related activities for both students and staff. To further build the ITU’s portfolio of academically relevant, high quality partners, new partners must be carefully selected. The ITU focuses on various criteria, depending on the type and objective of the collaboration. When choosing partners, the main selection criterion is the academic match in the subjectmatter as well as quality. Given the ITU’s interdisciplinary approach to IT education and re, it is ofhigh priority to find partners who either share this interdisciplinary approach or who have specificcomplementary qualities relative to the ITU’s study programmes. Furthermore, the university paysspecial attention to developing a number of strategic partnerships with select universities, with whom theuniversity collaborates closely in a range of re areas as well as education and exchange. The ITU focuses on developing a truly global network of partners. Thus, the university is continuously developing new and maintaining existing partnerships within the European area and other Western countries, but there is also a focus on developing stronger relations with partners in other areas that at are perceived to be of key importance to the re and teaching conducted at the ITU. The goal is a geographically diverse selection of exchange possibilities for each of our study programmes. The most important target groups for the ITU’s mobility activities are the 1st and 2nd cycle students at the university, as effort is needed to achieve increased mobility for these target groups and ensure academically relevant exchange possibilities for them. The ITU offers high quality support and counselling for incoming and outgoing exchange students with the objective of ensuring the best possible student experience from beginning to end, academically as well as socially. The university has a central administrative department handling, among others, international mobility and is positioned together. The impact of engaging in the Erasmus+ Programme and in projects is building new knowledge, to foster dialogue and common values, and being able to disseminate valuable knowledge and learning experiences to other educational institutions as well as societies. Indicators of success are, among others, additional external funding, and an increase in the number of publications the university produces. These areas have a high strategic priority for the university. The ITU has succeeded in making 100 % of re articles and re produced at the university freely available and for the benefit of people, society, businesses etc. When looking at how the ITU’s participation in the Programme has an impact on individuals outside of the university, it is important to mention our students' employability. Educating students with competences sought after in the local and global labour market is of high priority for the university and it is important that students are agile and obtain both transferable and inter-cultural skills. Cross-border cooperation and mobility of staff and students are initiatives that not only foster quality in teaching and learning but spending a semester or a shorter re stay abroad will also improve the students' employability in an ever-changing world that becomes more and more globalised. Increasing student and staff mobility is thus a high focus for the university during the Programme period. At ITU, each study programme has a global competence profile unique to that individual study programme. The global competence profile describes which global competences a graduate has obtained as part of their studies at ITU. At ITU, global competences are most often obtained through a mix of exchange programmes and learning activities – onsite, online, or blended – to give the graduates a varied and relevant set of competences. Engaging in the Programme activities is therefore a key element in supporting and framing the quality of internationalisation activities and competences in the university’s educational programmes. The ITU aims at offering free high-quality support and counselling for all incoming and outgoing exchange students and staff with the objective of ensuring the best possible student and staff experience from beginning to end, academically as well as socially. Participant reports are key indicators for reaching this goal. You can also download the Code of Conduct (UK) You can also download the Code of Conduct (DK) This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
    "word_count": 1421
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Factsheet-and-partner-universities#main",
    "title": "Factsheet & list of partner universities",
    "headings": [
      {
        "level": "h1",
        "text": "Factsheet & list of partner universities"
      },
      {
        "level": "h2",
        "text": "Here you will find a list of IT University of Copenhagen's partner universities and a factsheet for the international office."
      },
      {
        "level": "h3",
        "text": "Factsheet for 2026/27"
      },
      {
        "level": "h3",
        "text": "Partner Universities:"
      },
      {
        "level": "h3",
        "text": "AUSTRALIA"
      },
      {
        "level": "h3",
        "text": "AUSTRIA"
      },
      {
        "level": "h3",
        "text": "CANADA"
      },
      {
        "level": "h3",
        "text": "CHINA and TAIWAN"
      },
      {
        "level": "h3",
        "text": "CZECH REPUBLIC"
      },
      {
        "level": "h3",
        "text": "FINLAND"
      },
      {
        "level": "h3",
        "text": "FRANCE"
      },
      {
        "level": "h3",
        "text": "GERMANY"
      },
      {
        "level": "h3",
        "text": "ICELAND"
      },
      {
        "level": "h3",
        "text": "ITALY"
      },
      {
        "level": "h3",
        "text": "JAPAN"
      },
      {
        "level": "h3",
        "text": "KOREA"
      },
      {
        "level": "h3",
        "text": "NETHERLANDS"
      },
      {
        "level": "h3",
        "text": "NEW ZEALAND"
      },
      {
        "level": "h3",
        "text": "NORWAY"
      },
      {
        "level": "h3",
        "text": "PORTUGAL"
      },
      {
        "level": "h3",
        "text": "SINGAPORE"
      },
      {
        "level": "h3",
        "text": "SPAIN"
      },
      {
        "level": "h3",
        "text": "SWEDEN"
      },
      {
        "level": "h3",
        "text": "SWITZERLAND"
      },
      {
        "level": "h3",
        "text": "TURKEY"
      }
    ],
    "paragraphs": [
      "University of Technology Sydney Queensland University of Technology",
      "Graz University of Technology",
      "City University of Hong Kong National Taipei University of Technology",
      "Charles University Prague",
      "Université Montpellier 2 ESSEC Business School",
      "Politecnico di Milano University of Trento",
      "Kyoto University, Graduate School of Informatics",
      "Hanyang University Inha University Dankook University",
      "Maastricht University",
      "Victoria University of Wellington Auckland University of Technology",
      "University Nova Lisboa",
      "Universitat Politècnica de Catalunya Universidad Politécnica de Madrid",
      "Universitá della Svitzzera italiana",
      "Georgia Institute of Technology",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej"
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students",
        "text": "Exchange students"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "Exchange student at IT-University of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/ITU-Fact-Sheet-2026-2027-pdf.pdf",
        "text": "2026/27"
      }
    ],
    "metadata": {
      "description": "Here you will find a list of IT University of Copenhagen's partner universities and a factsheet for the international office."
    },
    "full_text": "Factsheet & list of partner universities Factsheet & list of partner universities Here you will find a list of IT University of Copenhagen's partner universities and a factsheet for the international office. Factsheet for 2026/27 Partner Universities: AUSTRALIA AUSTRIA CANADA CHINA and TAIWAN CZECH REPUBLIC FINLAND FRANCE GERMANY ICELAND ITALY JAPAN KOREA NETHERLANDS NEW ZEALAND NORWAY PORTUGAL SINGAPORE SPAIN SWEDEN SWITZERLAND TURKEY University of Technology Sydney Queensland University of Technology Graz University of Technology City University of Hong Kong National Taipei University of Technology Charles University Prague Université Montpellier 2 ESSEC Business School Politecnico di Milano University of Trento Kyoto University, Graduate School of Informatics Hanyang University Inha University Dankook University Maastricht University Victoria University of Wellington Auckland University of Technology University Nova Lisboa Universitat Politècnica de Catalunya Universidad Politécnica de Madrid Universitá della Svitzzera italiana Georgia Institute of Technology This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
    "word_count": 146
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Course-list",
    "title": "Course list",
    "headings": [
      {
        "level": "h2",
        "text": "How to find and choose courses"
      },
      {
        "level": "h2",
        "text": "Courses open for exchange students"
      }
    ],
    "paragraphs": [
      "Exchange students can choose courses across different study programmes at ITU, but only courses at their own level of studies.",
      "BSc students can only register for BSc courses and MSc students can only register for MSc courses. See the course description for each course for possible formal prerequisites. Please notice, the full course descriptions for Spring 2026 will not be published until November 15. Full list of courses and basic course information, such as abstract and learning outcomes, will be available from September 15, but can be subject to change. For course descriptions from previous semesters, please go ITU's Course Catalogue.",
      "In this course, you will learn how to analyze and improve the performance of a computer system with a specific focus on data-intensive systems.",
      "To investigate a system’s performance and come up with solutions to improve it, there are three key things to know.",
      "This is what we will cover in this course.",
      "The subject of the course is functional, declarative programming in general and F# in particular.",
      "This course gives an introduction to IoT as well as practical experience with the design and implementation of end-to-end IoT systems.",
      "Practical examples and exercises will predominatly be from domains Energy and Environment.",
      "This course introduces mobile app design and development using Kotlin and Jetpack Compose for the Android platform, with a focus on concurrency and modern architectural patterns.",
      "This course gives a fundamental overview of Android programming concepts and the best practices for mobile app development.",
      "The course \"DevOps, Software Evolution and Software Maintenance\" is a BSc elective.",
      "In this course, the students will discover all the software engineering activities that take place after an initial software product is delivered or after a legacy system is taken over from a theoretical and practical perspective. Students (in groups) will take over such a system that is live and serving users, they will refactor and migrate it to the languages and technologies of their liking. All subsequent DevOps, software evolution and software maintenance activities will be performed directly on the systems of the students.",
      "All use of generative artificial intelligence is allowed during the exam, as long as the student follows the official ITU guidelines on generative artificial intelligence.",
      "The course \"DevOps, Software Evolution and Software Maintenance\" is an MSc elective.",
      "In this course, the students will discover all the software engineering activities that take place after an initial software product is delivered or after a legacy system is taken over from a theoretical and practical perspective. Students (in groups) will take over such a system that is live and serving users, they will refactor and migrate it to the languages and technologies of their liking. All subsequent DevOps, software evolution and software maintenance activities will be performed directly on the systems of the students.",
      "This is a hands-on course that teaches you how to prove that programs are correct. You will get in-depth experience with tools for this task, as well as an understanding of the theory behind them. This course thus equips you to pursue a career in writing safety-critical systems, or in pursuing higher studies in this area.",
      "This is a hands-on course that teaches you how to prove that programs are correct. You will get in-depth experience with tools for this task, as well as an understanding of the theory behind them. This course thus equips you to pursue a career in writing safety-critical systems, or in pursuing higher studies in this area.",
      "Algorithmic problem solving is the art of designing algorithms to solve challenging programming problems. This requires extensive practice in classifying problems, choosing the right data structures, and identifying suitable algorithms. This is very different to a standard algorithm and data structure course, where the focus is on understanding the tools at hand, but not on using them to solve problems. This course bridges the gap between theoretical knowledge and practical solutions to computational problems.",
      "This course introduces the basic concepts of modern cryptography. The main focus is on provable security: mathematically defining security goals and proving that cryptographic algorithms fulfill such definitions under a set of assumptions. The course will cover how to formally define the confidentiality and integrity guarantees provided by fundamental private-key and public-key cryptographic primitives, as well as how to prove that popular algorithms achieve these guarantees.",
      "The course gives an in-depth introduction to the fundamental principles of statistics.",
      "The course addresses the process of datafication through the lenses of data visualization. Datafication is pervasive in contemporary society, presenting both challenges and opportunities for individuals and communities. However, it is neither a neutral nor a natural process. It occurs within specific sociotechnical systems, shaping and being shaped by their contexts, and has profound, far-reaching implications The course will explore this process dealing with the most urgent issues such as bias in data and data fairness and then, building of the critical understanding of data processes, it will introduce the key elements of practical data visualization.",
      "Dette kursus introducerer teorier og metoder knyttet til innovation med særligt fokus på produkter, services og systemer, der relaterer til eller involverer digitale teknologier. Kurset involverer fordybelse i forskellige typer innovationsprocesses, forståelse af organisationer som kontekst for innovation og indsigter i muligheder for innovation, innovationsstrategier og konkurrentanalyse. Gennem et case-baseret engagement med eksterne virksomhederr og organisationer vil de studerende formulere, afprøve og præsentere konkrete konceptforslag til innovation og argumentere for deres relevans for samarbejdspartneren.",
      "Kurset vil introducere og lære de studerende til Physical Computing, herunder udforske input- og output-modaliteter i interaktioner mellem menneske og maskine, der rækker ud over skærme, tastaturer og mus. Kurset vil lære de studerende de grundlæggende koncepter inden for elektronik og hvordan man arbejder med en mikrokontroller, f.eks. Arduino-platformen.",
      "New mandatory course for BDDIT 2026. Redesigned version of Philosophy of Science and Technology, DMD/B-DDIT (last offered Autumn 2024).",
      "The course provides a basic introduction to philosophical and ethical problems related to digital design. The course puts a special focus on digitality, exploring its foundations, ontology, and ethical implications.",
      "This course will introduce classes of tasks that are at the core of most real-world production systems. It will teach advanced solutions to solve these tasks on complex and large-scale data with state-of-the-art tools.",
      "This course addresses programming techniques with a focus on advanced type systems such as ownership types in Rust. The course combines practical programming experience with theoretical foundations in type systems and memory management.",
      "The course \"IT Program Management\" is a one semester 7.5 ECTS MSc elective in the MSc Computer Science program. The course focuses on program management theory and methods, key concepts, common re approaches, and case studies of IT programs. The course covers themes such as pitfalls of program management, IT program success and failure, and software engineering concepts including the software development life cycle and software development methodologies.",
      "In this course, we teach both advanced machine learning (ML) approaches and hands-on skills for applying these approaches to data science and computer science problems.",
      "This course examines the ethical contexts of data as socio-political phenomena. In highlighting the various ethical dilemmas that can arise in data saturated worlds, the course encourages students to contextualize, critique, and reflect upon how data are generated, for whom, and to what effects. It guides students in this endeavor by adopting a critical data studies approach focused on analyzing the structural conditions through which data emerge and have serious effects on the world. The course supports students in conducting an ethical analysis of a contemporary data dilemma arising within the public and private sectors.",
      "This course introduces students to business process improvement and automation, combining classic approaches such as Lean and Business Process Reengineering with emerging technologies like low-code automation, RPA, and generative AI. Through hands-on exercises and an industry project, students learn to model, analyze, improve, and automate processes while addressing implementation, governance, and sustainability challenges.",
      "This course introduces students to quantitative methods in the social sciences, with a focus on information systems and business re. Students learn to make valid statistical inferences from data, critique and design quantitative re, and apply business analytics and machine learning techniques to support organizational decision-making.",
      "The course introduces students to the foundations, methods, and practices of Artificial Intelligence within its organizational, social and political contexts. The course combines hands-on exploration of contemporary tools with critical perspectives on their use, equipping students to experiment with the development and use of AI systems and reflect on their broader implications and consequences.",
      "Students will work in groups on a project drawing from AI-based approaches (e.g., LLM finetuning, classification, clustering, or developing an AI-based service) to engage, explore or address a particular organizational or societal concern.",
      "This course introduces students to cutting-edge robotics re and hands-on applications. Over several multi-week modules, students will work with modern robotic systems, learning both theory and practical implementation. Each module covers a specific area of robotics re, combining lectures with hands-on projects that let students apply what they've learned. The course emphasizes practical problem-solving and real-world applications of robotics technology.",
      "In today's world of professional software development, ensuring your code works perfectly is not just a final step--it is an ongoing process. As systems become more complex, developers need more than just intuition and manual checks. They need systematic ways to test and analyze programs to catch bugs and validate behavior. This course is all about giving you the tools, techniques and hands-on experience to just do that.",
      "In this course, we teach advanced machine learning (ML) techniques and hands-on skills for applying these techniques to natural language processing (NLP) problems.",
      "This course introduces advanced machine learning techniques with a focus on the visual domain, emphasizing their role in both re and real-world applications. Students will gain practical skills through hands-on exercises to support theoretical understanding. We aim to enabling them to choose and adapt appropriate methods for specific tasks. In the age of generative AI, understanding the underlying principles is essential. The course contributes to developing AI literacy by introducing foundational concepts, diving into selected technical details, and fostering critical discussions around the capabilities and limitations of current approaches.",
      "In this course, you will learn different aspects of modern data systems, in particular state-of-the-art data mangement techniques that have been used or proposed in industry and academia.",
      "Learn how to analyze software systems to ensure they meet security policies under specific trust assumptions. This course covers topics such as information flow, declassification, non-interference, timing attacks, and program analysis tools, with a focus on reasoning about program behavior and securing data flows.",
      "This course focuses on using real-world data for protecting data and systems from cyberattacks. The course will be divided into two main thematic parts: cyber threat intelligence, which focuses on methods on using information about past cyberattacks and known attacker groups, and empirical re in human factors in security, focusing on studying human behavior in security-critical systems. The course is aimed at students with a background in computer science/data science with basic knowledge of cybersecurity.",
      "This course considers the nature as well as the challenges associated with ‘global project management and IT’.",
      "This is an introductory course on information security. The course focuses on introductory aspects of analysis, design and implementation of secure software.",
      "The course is an introduction to software engineering and software development for data science. The goal of the course is to allow students to join professional software engineering teams that include data scientist and data analysts.",
      "Revideret kursus for BDDIT 2024. Erstatningskursus for tidligere BDDIT optag",
      "Formålet med kurset er at give de studerende en grundlæggende forståelse for kvantitative metoder og deres anvendelse i både forskning og designpraksis.",
      "New Special Topic / Specialisation course for KDDIT 2024",
      "This course draws on theories and methods from Human Computer Interaction and Interaction Design and enhances students’ ability to critically analyze, understand and develop interactive technologies through hands-on experiments in a studio workspace.",
      "New Special Topic / Specialisation for KDDIT 2024",
      "AI-driven products are reshaping industries as well as our everyday lives, yet many fail due to poor user experience. This course equips designers with the theories, methods, and toolkits to work with AI/ML as a design material. Through project-based learning, students will gain experience with user re and design methods in the context of AI- driven products (e.g., personalized services, virtual assistants, generative AI).",
      "Contemporary organizations critically rely on enterprise systems and digital platforms to support and transform their business processes. In this course, students learn to analyze work systems within organizations and to identify ways for improving them. Students acquire these skills by analyzing a real-world work system and by gaining hands-on experience suggesting requirements for a sociotechnical system that supports the work system.",
      "The course will teach students to analyse complexity within an empirical case that explores a current topic within the fields of science, technology, and innovation.",
      "This is a course in mathematics covering linear algebra and analysis (calculus) of functions of several variables. These are perhaps the two areas of mathematics that have found most uses in practical applications. In particular, the course equips the student with mathematical tools necessary for analysis of big data.",
      "This hands-on course teaches you how the design, implementation, and implications, of computer systems influence your task as an application programmer. You will get an in-depth understanding of how hardware and the operating system work; in the process, you will learn how computers actually work, and what actually happens at the lowest level when you run an application. This enables you to fully exploit underlying hardware and systems software to write high-quality software.",
      "Discrete Mathematics covers different topics in mathematics, which support many disciplines in software development. The goal of this course is to give the students the ability to apply formal reasoning. The first part of the course is dedicated to learning how to construct logical proofs, proofs on set theory and proofs by induction, while the second half of the course builds upon the first part to cover number-theoretical concepts, graphs, combinatorics, discrete probabilities, and models of computation. The student will obtain the fundamental skill of computational thinking and will be better equipped to tackle technical subjects throughout the curriculum. The course is an introduction to discrete mathematics as a foundation to work within the fields of computer science, information technologies, and software development. The course develops the necessary terminology and conceptual tools needed for later courses.",
      "This course will introduce students to techniques for solving complex programming tasks arising in modern IT systems. The focus in the course is on algorithm design and analysis.",
      "This course addresses advanced programming techniques, with a special attention on functional programming and its applications. The course is a perfect balance of theory and practice, with focus on the Scala programming language.",
      "The course is designed to enable the student to engage with future developments in software engineering by providing a forum for the critical discussion of processes, methods, tools, and architectures. By combining theoretical insights from state-of-the-art re and hands-on experience with advanced tools and techniques, students gain a comprehensive understanding of software engineering.",
      "This course is an advanced course on algorithms which builds on top of an introductory course on algorithms and data structures. The course focuses on advanced techniques for identifying and solving computationally hard problems and on how to adapt such techniques to real-world scenarios.",
      "This course is about that part of programming that focuses on parallelism and concurrency. It covers concurrency concepts that are universal to any programming language. The Java programming language is the main language used for practically addressing such aspects; and Erlang is also used for a topic in the course.",
      "This course introduces key concepts from computing and provides critical and analytical skills for students to engage with a range of computational formats, artifacts, and genres of technical communication. The course enables students to navigate complex technical challenges and meaningfully participate in debates regarding the management of IT. Students learn to understand technical challenges in computing within in organizational, historical, and cultural context. The course is at an introductory level and is well-suited for students with limited or no technical background.",
      "The goal of the course is to address the complex entanglements of IT, innovation and society.",
      "This course introduces students to the foundations of handling heterogeneous data sources through the steps of data collection, annotation, processing, cleaning, integration, transformation, and visualization. Ethical issues and dataset bias are also discussed.",
      "This course gives an introduction to the field of data mining. The course is relatively practically oriented, focusing on applicable algorithms. Practical exercises will involve both use of a freely available data mining package and individual implementation of algorithms.",
      "In this course students will learn to apply modern state-of-the-art solutions for natural language processing problems. We go beyond simple classification tasks, and tackle more advanced types of tasks, like generation and structured prediction.",
      "Networks are all around us: We are ourselves, as individuals, the units of a network of social relationships of different kinds; the Internet and the highway system can be modelled as networks embedded in space; networks can be also entities defined in an abstract space, such as networks of acquaintances or collaborations between individuals. This course aims at providing the computational tools to study these networks and form an advanced understanding of the current state of the art of network science. The final objective is to have the students master computational techniques to solve advanced network problems, to be able to contribute to the development of network analysis, and to appreciate the limitations and future developments of scientific papers dealing with network problems in real-world data.",
      "Kursets formål er at give en dybere praktisk og teoretisk forståelse for implementation af programmeringssprog, herunder især maskinmodellen bag Java, C# og F#. Kursusemnerne omfatter leksikalsk analyse, grammatikker, syntaksanalyse, abstrakt syntaks, stakmaskiner, virtuelle maskiner, mellemkodesprog (inklusive JVM og .NET CLI), og continuations. Endvidere implementering af fortolkere, typeinferens, oversættere for en delmængde af C og for en delmængde af SML, garbage collectors, og kodegenerering for virtuelle maskiner og maskinkode (fx x86).",
      "The course is an introductory course to machine learning its mathematical foundation.",
      "This hands-on course teaches you how the design, implementation, and implications, of computer systems influence your task as an application programmer. You will get an in-depth understanding of how hardware and the operating system work; in the process, you will learn how computers actually work, and what actually happens at the lowest level when you run an application. This enables you to fully exploit underlying hardware and systems software to write high-quality software.",
      "Today we rarely use programs that are developed to fit one specific customer. When we play games, use business systems for administration, or download apps to our phones, we use software that is part of software ecosystems: software products that are configured to fit a specific business context; platforms like game engines that allow the development and sharing of software; or software as a service. Examples of software ecosystems have developed around software products, like game engines, or enterprise resource planning (ERP or CRM) software, integrated development environments like visual studio and platforms like the Android operating system.",
      "In this course you explore software ecosystems from UX design, organizational and technical perspectives. To this end you will analyse a software ecosystem together, propose an improvement related to the ecosystem, and support your proposal with a prototype and / or other design artefacts.",
      "This course enables students to understand the effects of automated digital systems on the way a welfare society is governed and experienced by social groups and individuals.",
      "The course aims at giving the students an introduction to the complexities of determining how processes of digitalisation and green transitions are entangled.",
      "The course aims at giving the students an introduction to the complexities of determining how processes of digitalisation and green transitions are entangled.",
      "Students attending this course will study how to design game code that is scalable and takes into account hardware and software resources.",
      "This course introduces fundamental and advanced concepts in statistics and probability from a data-science perspective. The aim of the course is for the student to be familiarised with probabilistic and statistical methods that are widely used in data analysis.",
      "This course examines organizations in light of contemporary challenges with digitalization. It explores organizational perspectives on digitalization and cover theories that can help us better understand, and critically reflect upon, such profound challenges, while also offering hands-on approaches to managing them. Furthermore, it investigates questions of the changing nature of work, and themes such as leadership, management, and organizing in order to make students both knowledgeable about, and skilled in the practice of, and engaging with, digital transformation.",
      "The course gives an in-depth introduction to fundamental principles of probability theory.",
      "The course aims to teach the understanding, design, implementation, and use of state-of-the-art artificial intelligence (AI) techniques applied to games and other simulation environments. We mainly cover methods to control agents (NPC, bots, robots, etc.), focusing on neural network-based approaches but also tree  techniques such as MCTS. Additionally, this course covers generative AI methods and their use for environment/game level generation, in addition to exploring the use of Large Language Models for games.",
      "The course is for students looking for an introduction to strategic management to be able to understand and navigate todays and tomorrows business world.The student will be given a toolbox of academic frameworks and models to be able to analyze current business situations and propose strategic changes. Through case studies and group work the student will become familiar with the business language which will help to bridge the gap between business and technology.",
      "The overall aim of the course is to enable students to understand and analyse relations between society and technology.",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
      "How to devise a methodology to design experiments so that you can investigate the system’s performance,",
      "The toolset to run the necessary experiments and collect the results, and",
      "At least a basic understanding of the systems layers (hardware, operating systems, etc.) to be able to interpret your results and come up with solutions.",
      "formal reasoning, proofs, logic, set theory, sequences and sums",
      "number theory, combinatorics and (discrete) probability theory",
      "induction, recursion and counting",
      "relations and functions",
      "basic graph theory, language theory",
      "theory and models of computation, such as finite state machines, regular expressions and grammars"
    ],
    "links": [],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Course list How to find and choose courses Courses open for exchange students Exchange students can choose courses across different study programmes at ITU, but only courses at their own level of studies. BSc students can only register for BSc courses and MSc students can only register for MSc courses. See the course description for each course for possible formal prerequisites. Please notice, the full course descriptions for Spring 2026 will not be published until November 15. Full list of courses and basic course information, such as abstract and learning outcomes, will be available from September 15, but can be subject to change. For course descriptions from previous semesters, please go ITU's Course Catalogue. In this course, you will learn how to analyze and improve the performance of a computer system with a specific focus on data-intensive systems. To investigate a system’s performance and come up with solutions to improve it, there are three key things to know. This is what we will cover in this course. The subject of the course is functional, declarative programming in general and F# in particular. This course gives an introduction to IoT as well as practical experience with the design and implementation of end-to-end IoT systems. Practical examples and exercises will predominatly be from domains Energy and Environment. This course introduces mobile app design and development using Kotlin and Jetpack Compose for the Android platform, with a focus on concurrency and modern architectural patterns. This course gives a fundamental overview of Android programming concepts and the best practices for mobile app development. The course \"DevOps, Software Evolution and Software Maintenance\" is a BSc elective. In this course, the students will discover all the software engineering activities that take place after an initial software product is delivered or after a legacy system is taken over from a theoretical and practical perspective. Students (in groups) will take over such a system that is live and serving users, they will refactor and migrate it to the languages and technologies of their liking. All subsequent DevOps, software evolution and software maintenance activities will be performed directly on the systems of the students. All use of generative artificial intelligence is allowed during the exam, as long as the student follows the official ITU guidelines on generative artificial intelligence. The course \"DevOps, Software Evolution and Software Maintenance\" is an MSc elective. In this course, the students will discover all the software engineering activities that take place after an initial software product is delivered or after a legacy system is taken over from a theoretical and practical perspective. Students (in groups) will take over such a system that is live and serving users, they will refactor and migrate it to the languages and technologies of their liking. All subsequent DevOps, software evolution and software maintenance activities will be performed directly on the systems of the students. This is a hands-on course that teaches you how to prove that programs are correct. You will get in-depth experience with tools for this task, as well as an understanding of the theory behind them. This course thus equips you to pursue a career in writing safety-critical systems, or in pursuing higher studies in this area. This is a hands-on course that teaches you how to prove that programs are correct. You will get in-depth experience with tools for this task, as well as an understanding of the theory behind them. This course thus equips you to pursue a career in writing safety-critical systems, or in pursuing higher studies in this area. Algorithmic problem solving is the art of designing algorithms to solve challenging programming problems. This requires extensive practice in classifying problems, choosing the right data structures, and identifying suitable algorithms. This is very different to a standard algorithm and data structure course, where the focus is on understanding the tools at hand, but not on using them to solve problems. This course bridges the gap between theoretical knowledge and practical solutions to computational problems. This course introduces the basic concepts of modern cryptography. The main focus is on provable security: mathematically defining security goals and proving that cryptographic algorithms fulfill such definitions under a set of assumptions. The course will cover how to formally define the confidentiality and integrity guarantees provided by fundamental private-key and public-key cryptographic primitives, as well as how to prove that popular algorithms achieve these guarantees. The course gives an in-depth introduction to the fundamental principles of statistics. The course addresses the process of datafication through the lenses of data visualization. Datafication is pervasive in contemporary society, presenting both challenges and opportunities for individuals and communities. However, it is neither a neutral nor a natural process. It occurs within specific sociotechnical systems, shaping and being shaped by their contexts, and has profound, far-reaching implications The course will explore this process dealing with the most urgent issues such as bias in data and data fairness and then, building of the critical understanding of data processes, it will introduce the key elements of practical data visualization. Dette kursus introducerer teorier og metoder knyttet til innovation med særligt fokus på produkter, services og systemer, der relaterer til eller involverer digitale teknologier. Kurset involverer fordybelse i forskellige typer innovationsprocesses, forståelse af organisationer som kontekst for innovation og indsigter i muligheder for innovation, innovationsstrategier og konkurrentanalyse. Gennem et case-baseret engagement med eksterne virksomhederr og organisationer vil de studerende formulere, afprøve og præsentere konkrete konceptforslag til innovation og argumentere for deres relevans for samarbejdspartneren. Kurset vil introducere og lære de studerende til Physical Computing, herunder udforske input- og output-modaliteter i interaktioner mellem menneske og maskine, der rækker ud over skærme, tastaturer og mus. Kurset vil lære de studerende de grundlæggende koncepter inden for elektronik og hvordan man arbejder med en mikrokontroller, f.eks. Arduino-platformen. New mandatory course for BDDIT 2026. Redesigned version of Philosophy of Science and Technology, DMD/B-DDIT (last offered Autumn 2024). The course provides a basic introduction to philosophical and ethical problems related to digital design. The course puts a special focus on digitality, exploring its foundations, ontology, and ethical implications. This course will introduce classes of tasks that are at the core of most real-world production systems. It will teach advanced solutions to solve these tasks on complex and large-scale data with state-of-the-art tools. This course addresses programming techniques with a focus on advanced type systems such as ownership types in Rust. The course combines practical programming experience with theoretical foundations in type systems and memory management. The course \"IT Program Management\" is a one semester 7.5 ECTS MSc elective in the MSc Computer Science program. The course focuses on program management theory and methods, key concepts, common re approaches, and case studies of IT programs. The course covers themes such as pitfalls of program management, IT program success and failure, and software engineering concepts including the software development life cycle and software development methodologies. In this course, we teach both advanced machine learning (ML) approaches and hands-on skills for applying these approaches to data science and computer science problems. This course examines the ethical contexts of data as socio-political phenomena. In highlighting the various ethical dilemmas that can arise in data saturated worlds, the course encourages students to contextualize, critique, and reflect upon how data are generated, for whom, and to what effects. It guides students in this endeavor by adopting a critical data studies approach focused on analyzing the structural conditions through which data emerge and have serious effects on the world. The course supports students in conducting an ethical analysis of a contemporary data dilemma arising within the public and private sectors. This course introduces students to business process improvement and automation, combining classic approaches such as Lean and Business Process Reengineering with emerging technologies like low-code automation, RPA, and generative AI. Through hands-on exercises and an industry project, students learn to model, analyze, improve, and automate processes while addressing implementation, governance, and sustainability challenges. This course introduces students to quantitative methods in the social sciences, with a focus on information systems and business re. Students learn to make valid statistical inferences from data, critique and design quantitative re, and apply business analytics and machine learning techniques to support organizational decision-making. The course introduces students to the foundations, methods, and practices of Artificial Intelligence within its organizational, social and political contexts. The course combines hands-on exploration of contemporary tools with critical perspectives on their use, equipping students to experiment with the development and use of AI systems and reflect on their broader implications and consequences. Students will work in groups on a project drawing from AI-based approaches (e.g., LLM finetuning, classification, clustering, or developing an AI-based service) to engage, explore or address a particular organizational or societal concern. This course introduces students to cutting-edge robotics re and hands-on applications. Over several multi-week modules, students will work with modern robotic systems, learning both theory and practical implementation. Each module covers a specific area of robotics re, combining lectures with hands-on projects that let students apply what they've learned. The course emphasizes practical problem-solving and real-world applications of robotics technology. In today's world of professional software development, ensuring your code works perfectly is not just a final step--it is an ongoing process. As systems become more complex, developers need more than just intuition and manual checks. They need systematic ways to test and analyze programs to catch bugs and validate behavior. This course is all about giving you the tools, techniques and hands-on experience to just do that. In this course, we teach advanced machine learning (ML) techniques and hands-on skills for applying these techniques to natural language processing (NLP) problems. This course introduces advanced machine learning techniques with a focus on the visual domain, emphasizing their role in both re and real-world applications. Students will gain practical skills through hands-on exercises to support theoretical understanding. We aim to enabling them to choose and adapt appropriate methods for specific tasks. In the age of generative AI, understanding the underlying principles is essential. The course contributes to developing AI literacy by introducing foundational concepts, diving into selected technical details, and fostering critical discussions around the capabilities and limitations of current approaches. In this course, you will learn different aspects of modern data systems, in particular state-of-the-art data mangement techniques that have been used or proposed in industry and academia. Learn how to analyze software systems to ensure they meet security policies under specific trust assumptions. This course covers topics such as information flow, declassification, non-interference, timing attacks, and program analysis tools, with a focus on reasoning about program behavior and securing data flows. This course focuses on using real-world data for protecting data and systems from cyberattacks. The course will be divided into two main thematic parts: cyber threat intelligence, which focuses on methods on using information about past cyberattacks and known attacker groups, and empirical re in human factors in security, focusing on studying human behavior in security-critical systems. The course is aimed at students with a background in computer science/data science with basic knowledge of cybersecurity. This course considers the nature as well as the challenges associated with ‘global project management and IT’. This is an introductory course on information security. The course focuses on introductory aspects of analysis, design and implementation of secure software. The course is an introduction to software engineering and software development for data science. The goal of the course is to allow students to join professional software engineering teams that include data scientist and data analysts. Revideret kursus for BDDIT 2024. Erstatningskursus for tidligere BDDIT optag Formålet med kurset er at give de studerende en grundlæggende forståelse for kvantitative metoder og deres anvendelse i både forskning og designpraksis. New Special Topic / Specialisation course for KDDIT 2024 This course draws on theories and methods from Human Computer Interaction and Interaction Design and enhances students’ ability to critically analyze, understand and develop interactive technologies through hands-on experiments in a studio workspace. New Special Topic / Specialisation for KDDIT 2024 AI-driven products are reshaping industries as well as our everyday lives, yet many fail due to poor user experience. This course equips designers with the theories, methods, and toolkits to work with AI/ML as a design material. Through project-based learning, students will gain experience with user re and design methods in the context of AI- driven products (e.g., personalized services, virtual assistants, generative AI). Contemporary organizations critically rely on enterprise systems and digital platforms to support and transform their business processes. In this course, students learn to analyze work systems within organizations and to identify ways for improving them. Students acquire these skills by analyzing a real-world work system and by gaining hands-on experience suggesting requirements for a sociotechnical system that supports the work system. The course will teach students to analyse complexity within an empirical case that explores a current topic within the fields of science, technology, and innovation. This is a course in mathematics covering linear algebra and analysis (calculus) of functions of several variables. These are perhaps the two areas of mathematics that have found most uses in practical applications. In particular, the course equips the student with mathematical tools necessary for analysis of big data. This hands-on course teaches you how the design, implementation, and implications, of computer systems influence your task as an application programmer. You will get an in-depth understanding of how hardware and the operating system work; in the process, you will learn how computers actually work, and what actually happens at the lowest level when you run an application. This enables you to fully exploit underlying hardware and systems software to write high-quality software. Discrete Mathematics covers different topics in mathematics, which support many disciplines in software development. The goal of this course is to give the students the ability to apply formal reasoning. The first part of the course is dedicated to learning how to construct logical proofs, proofs on set theory and proofs by induction, while the second half of the course builds upon the first part to cover number-theoretical concepts, graphs, combinatorics, discrete probabilities, and models of computation. The student will obtain the fundamental skill of computational thinking and will be better equipped to tackle technical subjects throughout the curriculum. The course is an introduction to discrete mathematics as a foundation to work within the fields of computer science, information technologies, and software development. The course develops the necessary terminology and conceptual tools needed for later courses. This course will introduce students to techniques for solving complex programming tasks arising in modern IT systems. The focus in the course is on algorithm design and analysis. This course addresses advanced programming techniques, with a special attention on functional programming and its applications. The course is a perfect balance of theory and practice, with focus on the Scala programming language. The course is designed to enable the student to engage with future developments in software engineering by providing a forum for the critical discussion of processes, methods, tools, and architectures. By combining theoretical insights from state-of-the-art re and hands-on experience with advanced tools and techniques, students gain a comprehensive understanding of software engineering. This course is an advanced course on algorithms which builds on top of an introductory course on algorithms and data structures. The course focuses on advanced techniques for identifying and solving computationally hard problems and on how to adapt such techniques to real-world scenarios. This course is about that part of programming that focuses on parallelism and concurrency. It covers concurrency concepts that are universal to any programming language. The Java programming language is the main language used for practically addressing such aspects; and Erlang is also used for a topic in the course. This course introduces key concepts from computing and provides critical and analytical skills for students to engage with a range of computational formats, artifacts, and genres of technical communication. The course enables students to navigate complex technical challenges and meaningfully participate in debates regarding the management of IT. Students learn to understand technical challenges in computing within in organizational, historical, and cultural context. The course is at an introductory level and is well-suited for students with limited or no technical background. The goal of the course is to address the complex entanglements of IT, innovation and society. This course introduces students to the foundations of handling heterogeneous data sources through the steps of data collection, annotation, processing, cleaning, integration, transformation, and visualization. Ethical issues and dataset bias are also discussed. This course gives an introduction to the field of data mining. The course is relatively practically oriented, focusing on applicable algorithms. Practical exercises will involve both use of a freely available data mining package and individual implementation of algorithms. In this course students will learn to apply modern state-of-the-art solutions for natural language processing problems. We go beyond simple classification tasks, and tackle more advanced types of tasks, like generation and structured prediction. Networks are all around us: We are ourselves, as individuals, the units of a network of social relationships of different kinds; the Internet and the highway system can be modelled as networks embedded in space; networks can be also entities defined in an abstract space, such as networks of acquaintances or collaborations between individuals. This course aims at providing the computational tools to study these networks and form an advanced understanding of the current state of the art of network science. The final objective is to have the students master computational techniques to solve advanced network problems, to be able to contribute to the development of network analysis, and to appreciate the limitations and future developments of scientific papers dealing with network problems in real-world data. Kursets formål er at give en dybere praktisk og teoretisk forståelse for implementation af programmeringssprog, herunder især maskinmodellen bag Java, C# og F#. Kursusemnerne omfatter leksikalsk analyse, grammatikker, syntaksanalyse, abstrakt syntaks, stakmaskiner, virtuelle maskiner, mellemkodesprog (inklusive JVM og .NET CLI), og continuations. Endvidere implementering af fortolkere, typeinferens, oversættere for en delmængde af C og for en delmængde af SML, garbage collectors, og kodegenerering for virtuelle maskiner og maskinkode (fx x86). The course is an introductory course to machine learning its mathematical foundation. This hands-on course teaches you how the design, implementation, and implications, of computer systems influence your task as an application programmer. You will get an in-depth understanding of how hardware and the operating system work; in the process, you will learn how computers actually work, and what actually happens at the lowest level when you run an application. This enables you to fully exploit underlying hardware and systems software to write high-quality software. Today we rarely use programs that are developed to fit one specific customer. When we play games, use business systems for administration, or download apps to our phones, we use software that is part of software ecosystems: software products that are configured to fit a specific business context; platforms like game engines that allow the development and sharing of software; or software as a service. Examples of software ecosystems have developed around software products, like game engines, or enterprise resource planning (ERP or CRM) software, integrated development environments like visual studio and platforms like the Android operating system. In this course you explore software ecosystems from UX design, organizational and technical perspectives. To this end you will analyse a software ecosystem together, propose an improvement related to the ecosystem, and support your proposal with a prototype and / or other design artefacts. This course enables students to understand the effects of automated digital systems on the way a welfare society is governed and experienced by social groups and individuals. The course aims at giving the students an introduction to the complexities of determining how processes of digitalisation and green transitions are entangled. The course aims at giving the students an introduction to the complexities of determining how processes of digitalisation and green transitions are entangled. Students attending this course will study how to design game code that is scalable and takes into account hardware and software resources. This course introduces fundamental and advanced concepts in statistics and probability from a data-science perspective. The aim of the course is for the student to be familiarised with probabilistic and statistical methods that are widely used in data analysis. This course examines organizations in light of contemporary challenges with digitalization. It explores organizational perspectives on digitalization and cover theories that can help us better understand, and critically reflect upon, such profound challenges, while also offering hands-on approaches to managing them. Furthermore, it investigates questions of the changing nature of work, and themes such as leadership, management, and organizing in order to make students both knowledgeable about, and skilled in the practice of, and engaging with, digital transformation. The course gives an in-depth introduction to fundamental principles of probability theory. The course aims to teach the understanding, design, implementation, and use of state-of-the-art artificial intelligence (AI) techniques applied to games and other simulation environments. We mainly cover methods to control agents (NPC, bots, robots, etc.), focusing on neural network-based approaches but also tree techniques such as MCTS. Additionally, this course covers generative AI methods and their use for environment/game level generation, in addition to exploring the use of Large Language Models for games. The course is for students looking for an introduction to strategic management to be able to understand and navigate todays and tomorrows business world.The student will be given a toolbox of academic frameworks and models to be able to analyze current business situations and propose strategic changes. Through case studies and group work the student will become familiar with the business language which will help to bridge the gap between business and technology. The overall aim of the course is to enable students to understand and analyse relations between society and technology. This page is printed from https://www.itu.dk/om-itu/bygning/find-vej How to devise a methodology to design experiments so that you can investigate the system’s performance, The toolset to run the necessary experiments and collect the results, and At least a basic understanding of the systems layers (hardware, operating systems, etc.) to be able to interpret your results and come up with solutions. formal reasoning, proofs, logic, set theory, sequences and sums number theory, combinatorics and (discrete) probability theory induction, recursion and counting relations and functions basic graph theory, language theory theory and models of computation, such as finite state machines, regular expressions and grammars",
    "word_count": 3725
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Factsheet-and-partner-universities",
    "title": "Factsheet & list of partner universities",
    "headings": [
      {
        "level": "h1",
        "text": "Factsheet & list of partner universities"
      },
      {
        "level": "h2",
        "text": "Here you will find a list of IT University of Copenhagen's partner universities and a factsheet for the international office."
      },
      {
        "level": "h3",
        "text": "Factsheet for 2026/27"
      },
      {
        "level": "h3",
        "text": "Partner Universities:"
      },
      {
        "level": "h3",
        "text": "AUSTRALIA"
      },
      {
        "level": "h3",
        "text": "AUSTRIA"
      },
      {
        "level": "h3",
        "text": "CANADA"
      },
      {
        "level": "h3",
        "text": "CHINA and TAIWAN"
      },
      {
        "level": "h3",
        "text": "CZECH REPUBLIC"
      },
      {
        "level": "h3",
        "text": "FINLAND"
      },
      {
        "level": "h3",
        "text": "FRANCE"
      },
      {
        "level": "h3",
        "text": "GERMANY"
      },
      {
        "level": "h3",
        "text": "ICELAND"
      },
      {
        "level": "h3",
        "text": "ITALY"
      },
      {
        "level": "h3",
        "text": "JAPAN"
      },
      {
        "level": "h3",
        "text": "KOREA"
      },
      {
        "level": "h3",
        "text": "NETHERLANDS"
      },
      {
        "level": "h3",
        "text": "NEW ZEALAND"
      },
      {
        "level": "h3",
        "text": "NORWAY"
      },
      {
        "level": "h3",
        "text": "PORTUGAL"
      },
      {
        "level": "h3",
        "text": "SINGAPORE"
      },
      {
        "level": "h3",
        "text": "SPAIN"
      },
      {
        "level": "h3",
        "text": "SWEDEN"
      },
      {
        "level": "h3",
        "text": "SWITZERLAND"
      },
      {
        "level": "h3",
        "text": "TURKEY"
      }
    ],
    "paragraphs": [
      "University of Technology Sydney Queensland University of Technology",
      "Graz University of Technology",
      "City University of Hong Kong National Taipei University of Technology",
      "Charles University Prague",
      "Université Montpellier 2 ESSEC Business School",
      "Politecnico di Milano University of Trento",
      "Kyoto University, Graduate School of Informatics",
      "Hanyang University Inha University Dankook University",
      "Maastricht University",
      "Victoria University of Wellington Auckland University of Technology",
      "University Nova Lisboa",
      "Universitat Politècnica de Catalunya Universidad Politécnica de Madrid",
      "Universitá della Svitzzera italiana",
      "Georgia Institute of Technology",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej"
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students",
        "text": "Exchange students"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "Exchange student at IT-University of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/ITU-Fact-Sheet-2026-2027-pdf.pdf",
        "text": "2026/27"
      }
    ],
    "metadata": {
      "description": "Here you will find a list of IT University of Copenhagen's partner universities and a factsheet for the international office."
    },
    "full_text": "Factsheet & list of partner universities Factsheet & list of partner universities Here you will find a list of IT University of Copenhagen's partner universities and a factsheet for the international office. Factsheet for 2026/27 Partner Universities: AUSTRALIA AUSTRIA CANADA CHINA and TAIWAN CZECH REPUBLIC FINLAND FRANCE GERMANY ICELAND ITALY JAPAN KOREA NETHERLANDS NEW ZEALAND NORWAY PORTUGAL SINGAPORE SPAIN SWEDEN SWITZERLAND TURKEY University of Technology Sydney Queensland University of Technology Graz University of Technology City University of Hong Kong National Taipei University of Technology Charles University Prague Université Montpellier 2 ESSEC Business School Politecnico di Milano University of Trento Kyoto University, Graduate School of Informatics Hanyang University Inha University Dankook University Maastricht University Victoria University of Wellington Auckland University of Technology University Nova Lisboa Universitat Politècnica de Catalunya Universidad Politécnica de Madrid Universitá della Svitzzera italiana Georgia Institute of Technology This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
    "word_count": 146
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Erasmus-policy-statement#main",
    "title": "Erasmus Policy Statement By The IT University Of Copenhagen",
    "headings": [
      {
        "level": "h1",
        "text": "Erasmus Policy Statement By The IT University Of Copenhagen"
      }
    ],
    "paragraphs": [
      "The vision of the IT University of Copenhagen (ITU) is to create and share knowledge that is profound and leads to ground-breaking information technology and services for the benefit of humanity. This vision requires the university to deliver international leading teaching and re to be exceptionally good at creating value with IT. The ITU is an innovative, globally active university that focuses on carrying out teaching and re of the highest quality for attracting and providing the world with talent, who can make a difference in the world of today and tomorrow. External engagement has a central role in the overall strategy of the university where it is described as both a means to achieve world class teaching and re and a means to engage a global network into the university’s existing close collaboration with its Danish stakeholders. Engaging in externally funded re projects involving external partners is thus considered one of the main means to achieve the university’s overall objectives. Therefore, a high number of re projects at the university are conducted in collaboration with external partners locally and globally – be it private, public or NGOs – which in turn have a direct or indirect influence on local, regional, and global development. To be able to do so means engaging with a network of global relations in a meaningful and constructive way and include funding from the Erasmus+ Programme as well as other external funding.",
      "A core strategic focus for the ITU is to deliver re which addresses societal challenges and provides solutions that can lead to new insight and ways of using IT for the benefit of humanity. IT is widely regarded as an indispensable driver of change, innovation, and economic growth, and digital technology and the ITU will contribute significantly to solving the global challenges of the future, be it health, climate, or economic challenges. By offering study programmes within this area or engaging external partners in re activities, ITU can help provide society with civically engaged citizens who can contribute to a sustainable future with IT solutions. Managing the university’s changing network of global relations in a constructive way and ensuring that the ITU’s re and study programmes are attuned to the globalised context of which they are a part are also key success factors in the university’s re, educational programmes, and related strategies. Engaging in the Programme supports this vision to a high degree. The ITU focuses on developing a network which is truly global, i.e. it must not be limited to the parts of the world that have hitherto set the agenda for IT teaching and re.",
      "The ITU focuses on educating not only students but also facilitates the life-long learning of staff to develop key skills for a changing world and university sector. The ITU believes that it is highly relevant and beneficial to engage in the staff teaching and training activities that the Erasmus+ Programme provides alongside the opportunities the ITU offers. As the Erasmus+ Programme supports the goal of achieving a high level of digitalisation so is digitalisation at the core of all activities at the ITU. We believe that carrying out activities that lead to ground-breaking information technologies or services requires collaboration between people who hold different perspectives on IT. The university’s interdisciplinary approach permeates the re activities as well as in the design of the educational programmes. Digitalisation is also a goal for administrative departments for optimising work processes and being agile in an ever-changing world. Reaching the goal of internationally leading teaching and re necessitates close collaboration in a multitude of ways with relevant external partners. Thus, participating in the Programme’s project activities is a central part of the ITU’s overall internationalisation strategy. Working with mobility of faculty and students as well as with other and more encompassing types of cross-border cooperation is considered both a natural and a necessary means to achieve many of the university’s strategic objectives, both within re and education. ITU believes that mobility of talent is important when striving for excellence. Therefore, the ITU plans to continue supporting existing partnerships and developing new cooperation with partners in the EU and non-EU countries, including partnerships which focus on joint teaching and educational activities. The ITU also plans to continue to promote and support student and staff mobility and recognises and communicates the importance of theinternationally related activities for both students and staff. To further build the ITU’s portfolio of academically relevant, high quality partners, new partners must be carefully selected. The ITU focuses on various criteria, depending on the type and objective of the collaboration. When choosing partners, the main selection criterion is the academic match in the subjectmatter as well as quality. Given the ITU’s interdisciplinary approach to IT education and re, it is ofhigh priority to find partners who either share this interdisciplinary approach or who have specificcomplementary qualities relative to the ITU’s study programmes. Furthermore, the university paysspecial attention to developing a number of strategic partnerships with select universities, with whom theuniversity collaborates closely in a range of re areas as well as education and exchange. The ITU focuses on developing a truly global network of partners. Thus, the university is continuously developing new and maintaining existing partnerships within the European area and other Western countries, but there is also a focus on developing stronger relations with partners in other areas that at are perceived to be of key importance to the re and teaching conducted at the ITU. The goal is a geographically diverse selection of exchange possibilities for each of our study programmes. The most important target groups for the ITU’s mobility activities are the 1st and 2nd cycle students at the university, as effort is needed to achieve increased mobility for these target groups and ensure academically relevant exchange possibilities for them. The ITU offers high quality support and counselling for incoming and outgoing exchange students with the objective of ensuring the best possible student experience from beginning to end, academically as well as socially. The university has a central administrative department handling, among others, international mobility and is positioned together.",
      "The impact of engaging in the Erasmus+ Programme and in projects is building new knowledge, to foster dialogue and common values, and being able to disseminate valuable knowledge and learning experiences to other educational institutions as well as societies. Indicators of success are, among others, additional external funding, and an increase in the number of publications the university produces. These areas have a high strategic priority for the university. The ITU has succeeded in making 100 % of re articles and re produced at the university freely available and for the benefit of people, society, businesses etc. When looking at how the ITU’s participation in the Programme has an impact on individuals outside of the university, it is important to mention our students' employability. Educating students with competences sought after in the local and global labour market is of high priority for the university and it is important that students are agile and obtain both transferable and inter-cultural skills. Cross-border cooperation and mobility of staff and students are initiatives that not only foster quality in teaching and learning but spending a semester or a shorter re stay abroad will also improve the students' employability in an ever-changing world that becomes more and more globalised. Increasing student and staff mobility is thus a high focus for the university during the Programme period. At ITU, each study programme has a global competence profile unique to that individual study programme. The global competence profile describes which global competences a graduate has obtained as part of their studies at ITU. At ITU, global competences are most often obtained through a mix of exchange programmes and learning activities – onsite, online, or blended – to give the graduates a varied and relevant set of competences. Engaging in the Programme activities is therefore a key element in supporting and framing the quality of internationalisation activities and competences in the university’s educational programmes. The ITU aims at offering free high-quality support and counselling for all incoming and outgoing exchange students and staff with the objective of ensuring the best possible student and staff experience from beginning to end, academically as well as socially. Participant reports are key indicators for reaching this goal.",
      "You can also download the Code of Conduct (UK)",
      "You can also download the Code of Conduct (DK)",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej"
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students",
        "text": "Exchange students"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "Exchange student at IT-University of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/CoC-FINAL-som-på-ufm-dk-EN-pdf.pdf",
        "text": "You can also download the Code of Conduct (UK)"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/CoC-FINAL-som-lanceret-på-ufm-dk-pdf.pdf",
        "text": "You can also download the Code of Conduct (DK)"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/Ersamus-Charter-ITU_2021-pdf.pdf",
        "text": "The Erasmus Charter"
      }
    ],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Erasmus Policy Statement By The IT University Of Copenhagen Erasmus Policy Statement By The IT University Of Copenhagen The vision of the IT University of Copenhagen (ITU) is to create and share knowledge that is profound and leads to ground-breaking information technology and services for the benefit of humanity. This vision requires the university to deliver international leading teaching and re to be exceptionally good at creating value with IT. The ITU is an innovative, globally active university that focuses on carrying out teaching and re of the highest quality for attracting and providing the world with talent, who can make a difference in the world of today and tomorrow. External engagement has a central role in the overall strategy of the university where it is described as both a means to achieve world class teaching and re and a means to engage a global network into the university’s existing close collaboration with its Danish stakeholders. Engaging in externally funded re projects involving external partners is thus considered one of the main means to achieve the university’s overall objectives. Therefore, a high number of re projects at the university are conducted in collaboration with external partners locally and globally – be it private, public or NGOs – which in turn have a direct or indirect influence on local, regional, and global development. To be able to do so means engaging with a network of global relations in a meaningful and constructive way and include funding from the Erasmus+ Programme as well as other external funding. A core strategic focus for the ITU is to deliver re which addresses societal challenges and provides solutions that can lead to new insight and ways of using IT for the benefit of humanity. IT is widely regarded as an indispensable driver of change, innovation, and economic growth, and digital technology and the ITU will contribute significantly to solving the global challenges of the future, be it health, climate, or economic challenges. By offering study programmes within this area or engaging external partners in re activities, ITU can help provide society with civically engaged citizens who can contribute to a sustainable future with IT solutions. Managing the university’s changing network of global relations in a constructive way and ensuring that the ITU’s re and study programmes are attuned to the globalised context of which they are a part are also key success factors in the university’s re, educational programmes, and related strategies. Engaging in the Programme supports this vision to a high degree. The ITU focuses on developing a network which is truly global, i.e. it must not be limited to the parts of the world that have hitherto set the agenda for IT teaching and re. The ITU focuses on educating not only students but also facilitates the life-long learning of staff to develop key skills for a changing world and university sector. The ITU believes that it is highly relevant and beneficial to engage in the staff teaching and training activities that the Erasmus+ Programme provides alongside the opportunities the ITU offers. As the Erasmus+ Programme supports the goal of achieving a high level of digitalisation so is digitalisation at the core of all activities at the ITU. We believe that carrying out activities that lead to ground-breaking information technologies or services requires collaboration between people who hold different perspectives on IT. The university’s interdisciplinary approach permeates the re activities as well as in the design of the educational programmes. Digitalisation is also a goal for administrative departments for optimising work processes and being agile in an ever-changing world. Reaching the goal of internationally leading teaching and re necessitates close collaboration in a multitude of ways with relevant external partners. Thus, participating in the Programme’s project activities is a central part of the ITU’s overall internationalisation strategy. Working with mobility of faculty and students as well as with other and more encompassing types of cross-border cooperation is considered both a natural and a necessary means to achieve many of the university’s strategic objectives, both within re and education. ITU believes that mobility of talent is important when striving for excellence. Therefore, the ITU plans to continue supporting existing partnerships and developing new cooperation with partners in the EU and non-EU countries, including partnerships which focus on joint teaching and educational activities. The ITU also plans to continue to promote and support student and staff mobility and recognises and communicates the importance of theinternationally related activities for both students and staff. To further build the ITU’s portfolio of academically relevant, high quality partners, new partners must be carefully selected. The ITU focuses on various criteria, depending on the type and objective of the collaboration. When choosing partners, the main selection criterion is the academic match in the subjectmatter as well as quality. Given the ITU’s interdisciplinary approach to IT education and re, it is ofhigh priority to find partners who either share this interdisciplinary approach or who have specificcomplementary qualities relative to the ITU’s study programmes. Furthermore, the university paysspecial attention to developing a number of strategic partnerships with select universities, with whom theuniversity collaborates closely in a range of re areas as well as education and exchange. The ITU focuses on developing a truly global network of partners. Thus, the university is continuously developing new and maintaining existing partnerships within the European area and other Western countries, but there is also a focus on developing stronger relations with partners in other areas that at are perceived to be of key importance to the re and teaching conducted at the ITU. The goal is a geographically diverse selection of exchange possibilities for each of our study programmes. The most important target groups for the ITU’s mobility activities are the 1st and 2nd cycle students at the university, as effort is needed to achieve increased mobility for these target groups and ensure academically relevant exchange possibilities for them. The ITU offers high quality support and counselling for incoming and outgoing exchange students with the objective of ensuring the best possible student experience from beginning to end, academically as well as socially. The university has a central administrative department handling, among others, international mobility and is positioned together. The impact of engaging in the Erasmus+ Programme and in projects is building new knowledge, to foster dialogue and common values, and being able to disseminate valuable knowledge and learning experiences to other educational institutions as well as societies. Indicators of success are, among others, additional external funding, and an increase in the number of publications the university produces. These areas have a high strategic priority for the university. The ITU has succeeded in making 100 % of re articles and re produced at the university freely available and for the benefit of people, society, businesses etc. When looking at how the ITU’s participation in the Programme has an impact on individuals outside of the university, it is important to mention our students' employability. Educating students with competences sought after in the local and global labour market is of high priority for the university and it is important that students are agile and obtain both transferable and inter-cultural skills. Cross-border cooperation and mobility of staff and students are initiatives that not only foster quality in teaching and learning but spending a semester or a shorter re stay abroad will also improve the students' employability in an ever-changing world that becomes more and more globalised. Increasing student and staff mobility is thus a high focus for the university during the Programme period. At ITU, each study programme has a global competence profile unique to that individual study programme. The global competence profile describes which global competences a graduate has obtained as part of their studies at ITU. At ITU, global competences are most often obtained through a mix of exchange programmes and learning activities – onsite, online, or blended – to give the graduates a varied and relevant set of competences. Engaging in the Programme activities is therefore a key element in supporting and framing the quality of internationalisation activities and competences in the university’s educational programmes. The ITU aims at offering free high-quality support and counselling for all incoming and outgoing exchange students and staff with the objective of ensuring the best possible student and staff experience from beginning to end, academically as well as socially. Participant reports are key indicators for reaching this goal. You can also download the Code of Conduct (UK) You can also download the Code of Conduct (DK) This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
    "word_count": 1421
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU#main",
    "title": "Exchange student at IT-University of Copenhagen",
    "headings": [
      {
        "level": "h1",
        "text": "Exchange Students"
      },
      {
        "level": "h2",
        "text": "Why do an exchange at ITU"
      },
      {
        "level": "h2",
        "text": "Summer university courses"
      },
      {
        "level": "h2",
        "text": "Free Mover"
      },
      {
        "level": "h2",
        "text": "Erasmus documents"
      },
      {
        "level": "h2",
        "text": "Follow @itustudent on  and meet more ITU students"
      },
      {
        "level": "h3",
        "text": "How to become an exchange student"
      },
      {
        "level": "h3",
        "text": "Academic calender"
      },
      {
        "level": "h3",
        "text": "Become a free mover at ITU"
      },
      {
        "level": "h3",
        "text": "Apply for admission"
      }
    ],
    "paragraphs": [
      "As an exchange student the IT University of Copenhagen, you'll find a mix of lectures, hands-on exercises, and group projects that help you engage with real-world challenges. Our re-driven programmes are regularly updated in collaboration with industry, so the skills you develop are relevant and valued in today’s job market.",
      "During your exchange stay at ITU, you’ll have the chance to build practical knowledge and connect with opportunities that can support your future career.",
      "The IT University welcomes exchange students from our partner universities from all over the world each year to study one or two semesters or during the summer with us. To be an exchange student at the IT University, your home university has to have an Erasmus+ or bilateral partnership agreement with us.",
      "You can see the list of IT University partner universities, if you expand the paragraph below. If your university is not listed, please  your university regarding cooperation opportunities with us. Moreover, it is possible to become a free mover at the IT University (read more about free mover at the bottom of this page).",
      "To become an exchange student your home university needs to officially nominate you before you can apply to us. After being nominated, we will guide you in the application process.",
      "Autumn: The academic semester starts Monday in week 35. The Intro Day for exchange students take place Thursday or Friday in week 34. The teaching runs for 14 weeks and the exams are held in December/January. The re-exams are held in February (re-submission)/March. Spring: The academic semester starts Monday in week 5. The Intro Day for exchange students takes place Thursday or Friday in week 4. The teaching runs for 14 weeks and the exams are held in May/June. The re-exams are held in July (re-submission)/August. Summer: The teaching takes place in week 28-31. The exams are held in week 32 and the re-exams in week 34.",
      "ITU Summer University consists of several summer courses taught at the IT University of Copenhagen during July and August. The summer courses are taught by ITU’s teaching staff as well as by guest lecturers/teachers. As an exchange student you can take one of these summer courses together with students from the ITU.",
      "See the Summer University courses in the course catalogue for exchange students in the \"Find courses\" box. Please note, you can register for one course of 7.5 ECTS on your own programme level only.",
      "If your home university does not have an Erasmus+ or bilateral partnership agreement with the IT University, you can become a free mover at ITU. As a free mover, you have to pay tuition fee for the courses at the IT University.",
      "Please note that if you are a non-EU/EEA citizen, you need a residence permit in Denmark to apply as a free mover.",
      "You apply for admission via the application portal for ‘Single subjects’. You will find tuition fees, deadlines and the link to the application portal here. In the application system, you must choose ‘Student Place Vacancy’ as the type of education. If you have any questions, please  ITU Professional Education at professionaleducation@itu.dk",
      "The IT University of Copenhagen is an innovative, globally active university that focuses on carrying out teaching and re of the highest quality for attracting and providing the world with talent, who can make a difference in the world of today and tomorrow.",
      "In support of this, the IT University engages in bilateral partnerships and the Erasmus+ programme for knowledge-sharing and the exchange of students and staff.",
      "Read the Erasmus Policy Statement By The IT University Of Copenhagen",
      "Read the ITU Erasmus policy (UK)",
      "Read the Erasmus charter",
      "If you have any questions, please  Student Affairs and Programmes at sap@itu.dk",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej"
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Course-list",
        "text": "Find courses"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/How-to-apply-to-become-exchange-student",
        "text": "How to apply"
      },
      {
        "url": "https://en.itu.dk/Programmes/Student-Life/Practical-information-for-international-students",
        "text": "Practical information"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Factsheet-and-partner-universities",
        "text": "Factsheet & Partner Universities"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Erasmus-policy-statement",
        "text": "Read the Erasmus Policy Statement By The IT University Of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/CoC-FINAL-som-på-ufm-dk-EN-pdf.pdf",
        "text": "Read the ITU Erasmus policy (UK)"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/Ersamus-Charter-ITU_2021-pdf.pdf",
        "text": "Read the Erasmus charter"
      }
    ],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Exchange student at IT-University of Copenhagen Exchange Students Why do an exchange at ITU Summer university courses Free Mover Erasmus documents Follow @itustudent on and meet more ITU students How to become an exchange student Academic calender Become a free mover at ITU Apply for admission As an exchange student the IT University of Copenhagen, you'll find a mix of lectures, hands-on exercises, and group projects that help you engage with real-world challenges. Our re-driven programmes are regularly updated in collaboration with industry, so the skills you develop are relevant and valued in today’s job market. During your exchange stay at ITU, you’ll have the chance to build practical knowledge and connect with opportunities that can support your future career. The IT University welcomes exchange students from our partner universities from all over the world each year to study one or two semesters or during the summer with us. To be an exchange student at the IT University, your home university has to have an Erasmus+ or bilateral partnership agreement with us. You can see the list of IT University partner universities, if you expand the paragraph below. If your university is not listed, please your university regarding cooperation opportunities with us. Moreover, it is possible to become a free mover at the IT University (read more about free mover at the bottom of this page). To become an exchange student your home university needs to officially nominate you before you can apply to us. After being nominated, we will guide you in the application process. Autumn: The academic semester starts Monday in week 35. The Intro Day for exchange students take place Thursday or Friday in week 34. The teaching runs for 14 weeks and the exams are held in December/January. The re-exams are held in February (re-submission)/March. Spring: The academic semester starts Monday in week 5. The Intro Day for exchange students takes place Thursday or Friday in week 4. The teaching runs for 14 weeks and the exams are held in May/June. The re-exams are held in July (re-submission)/August. Summer: The teaching takes place in week 28-31. The exams are held in week 32 and the re-exams in week 34. ITU Summer University consists of several summer courses taught at the IT University of Copenhagen during July and August. The summer courses are taught by ITU’s teaching staff as well as by guest lecturers/teachers. As an exchange student you can take one of these summer courses together with students from the ITU. See the Summer University courses in the course catalogue for exchange students in the \"Find courses\" box. Please note, you can register for one course of 7.5 ECTS on your own programme level only. If your home university does not have an Erasmus+ or bilateral partnership agreement with the IT University, you can become a free mover at ITU. As a free mover, you have to pay tuition fee for the courses at the IT University. Please note that if you are a non-EU/EEA citizen, you need a residence permit in Denmark to apply as a free mover. You apply for admission via the application portal for ‘Single subjects’. You will find tuition fees, deadlines and the link to the application portal here. In the application system, you must choose ‘Student Place Vacancy’ as the type of education. If you have any questions, please ITU Professional Education at professionaleducation@itu.dk The IT University of Copenhagen is an innovative, globally active university that focuses on carrying out teaching and re of the highest quality for attracting and providing the world with talent, who can make a difference in the world of today and tomorrow. In support of this, the IT University engages in bilateral partnerships and the Erasmus+ programme for knowledge-sharing and the exchange of students and staff. Read the Erasmus Policy Statement By The IT University Of Copenhagen Read the ITU Erasmus policy (UK) Read the Erasmus charter If you have any questions, please Student Affairs and Programmes at sap@itu.dk This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
    "word_count": 670
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Course-list#main",
    "title": "Course list",
    "headings": [
      {
        "level": "h2",
        "text": "How to find and choose courses"
      },
      {
        "level": "h2",
        "text": "Courses open for exchange students"
      }
    ],
    "paragraphs": [
      "Exchange students can choose courses across different study programmes at ITU, but only courses at their own level of studies.",
      "BSc students can only register for BSc courses and MSc students can only register for MSc courses. See the course description for each course for possible formal prerequisites. Please notice, the full course descriptions for Spring 2026 will not be published until November 15. Full list of courses and basic course information, such as abstract and learning outcomes, will be available from September 15, but can be subject to change. For course descriptions from previous semesters, please go ITU's Course Catalogue.",
      "In this course, you will learn how to analyze and improve the performance of a computer system with a specific focus on data-intensive systems.",
      "To investigate a system’s performance and come up with solutions to improve it, there are three key things to know.",
      "This is what we will cover in this course.",
      "The subject of the course is functional, declarative programming in general and F# in particular.",
      "This course gives an introduction to IoT as well as practical experience with the design and implementation of end-to-end IoT systems.",
      "Practical examples and exercises will predominatly be from domains Energy and Environment.",
      "This course introduces mobile app design and development using Kotlin and Jetpack Compose for the Android platform, with a focus on concurrency and modern architectural patterns.",
      "This course gives a fundamental overview of Android programming concepts and the best practices for mobile app development.",
      "The course \"DevOps, Software Evolution and Software Maintenance\" is a BSc elective.",
      "In this course, the students will discover all the software engineering activities that take place after an initial software product is delivered or after a legacy system is taken over from a theoretical and practical perspective. Students (in groups) will take over such a system that is live and serving users, they will refactor and migrate it to the languages and technologies of their liking. All subsequent DevOps, software evolution and software maintenance activities will be performed directly on the systems of the students.",
      "All use of generative artificial intelligence is allowed during the exam, as long as the student follows the official ITU guidelines on generative artificial intelligence.",
      "The course \"DevOps, Software Evolution and Software Maintenance\" is an MSc elective.",
      "In this course, the students will discover all the software engineering activities that take place after an initial software product is delivered or after a legacy system is taken over from a theoretical and practical perspective. Students (in groups) will take over such a system that is live and serving users, they will refactor and migrate it to the languages and technologies of their liking. All subsequent DevOps, software evolution and software maintenance activities will be performed directly on the systems of the students.",
      "This is a hands-on course that teaches you how to prove that programs are correct. You will get in-depth experience with tools for this task, as well as an understanding of the theory behind them. This course thus equips you to pursue a career in writing safety-critical systems, or in pursuing higher studies in this area.",
      "This is a hands-on course that teaches you how to prove that programs are correct. You will get in-depth experience with tools for this task, as well as an understanding of the theory behind them. This course thus equips you to pursue a career in writing safety-critical systems, or in pursuing higher studies in this area.",
      "Algorithmic problem solving is the art of designing algorithms to solve challenging programming problems. This requires extensive practice in classifying problems, choosing the right data structures, and identifying suitable algorithms. This is very different to a standard algorithm and data structure course, where the focus is on understanding the tools at hand, but not on using them to solve problems. This course bridges the gap between theoretical knowledge and practical solutions to computational problems.",
      "This course introduces the basic concepts of modern cryptography. The main focus is on provable security: mathematically defining security goals and proving that cryptographic algorithms fulfill such definitions under a set of assumptions. The course will cover how to formally define the confidentiality and integrity guarantees provided by fundamental private-key and public-key cryptographic primitives, as well as how to prove that popular algorithms achieve these guarantees.",
      "The course gives an in-depth introduction to the fundamental principles of statistics.",
      "The course addresses the process of datafication through the lenses of data visualization. Datafication is pervasive in contemporary society, presenting both challenges and opportunities for individuals and communities. However, it is neither a neutral nor a natural process. It occurs within specific sociotechnical systems, shaping and being shaped by their contexts, and has profound, far-reaching implications The course will explore this process dealing with the most urgent issues such as bias in data and data fairness and then, building of the critical understanding of data processes, it will introduce the key elements of practical data visualization.",
      "Dette kursus introducerer teorier og metoder knyttet til innovation med særligt fokus på produkter, services og systemer, der relaterer til eller involverer digitale teknologier. Kurset involverer fordybelse i forskellige typer innovationsprocesses, forståelse af organisationer som kontekst for innovation og indsigter i muligheder for innovation, innovationsstrategier og konkurrentanalyse. Gennem et case-baseret engagement med eksterne virksomhederr og organisationer vil de studerende formulere, afprøve og præsentere konkrete konceptforslag til innovation og argumentere for deres relevans for samarbejdspartneren.",
      "Kurset vil introducere og lære de studerende til Physical Computing, herunder udforske input- og output-modaliteter i interaktioner mellem menneske og maskine, der rækker ud over skærme, tastaturer og mus. Kurset vil lære de studerende de grundlæggende koncepter inden for elektronik og hvordan man arbejder med en mikrokontroller, f.eks. Arduino-platformen.",
      "New mandatory course for BDDIT 2026. Redesigned version of Philosophy of Science and Technology, DMD/B-DDIT (last offered Autumn 2024).",
      "The course provides a basic introduction to philosophical and ethical problems related to digital design. The course puts a special focus on digitality, exploring its foundations, ontology, and ethical implications.",
      "This course will introduce classes of tasks that are at the core of most real-world production systems. It will teach advanced solutions to solve these tasks on complex and large-scale data with state-of-the-art tools.",
      "This course addresses programming techniques with a focus on advanced type systems such as ownership types in Rust. The course combines practical programming experience with theoretical foundations in type systems and memory management.",
      "The course \"IT Program Management\" is a one semester 7.5 ECTS MSc elective in the MSc Computer Science program. The course focuses on program management theory and methods, key concepts, common re approaches, and case studies of IT programs. The course covers themes such as pitfalls of program management, IT program success and failure, and software engineering concepts including the software development life cycle and software development methodologies.",
      "In this course, we teach both advanced machine learning (ML) approaches and hands-on skills for applying these approaches to data science and computer science problems.",
      "This course examines the ethical contexts of data as socio-political phenomena. In highlighting the various ethical dilemmas that can arise in data saturated worlds, the course encourages students to contextualize, critique, and reflect upon how data are generated, for whom, and to what effects. It guides students in this endeavor by adopting a critical data studies approach focused on analyzing the structural conditions through which data emerge and have serious effects on the world. The course supports students in conducting an ethical analysis of a contemporary data dilemma arising within the public and private sectors.",
      "This course introduces students to business process improvement and automation, combining classic approaches such as Lean and Business Process Reengineering with emerging technologies like low-code automation, RPA, and generative AI. Through hands-on exercises and an industry project, students learn to model, analyze, improve, and automate processes while addressing implementation, governance, and sustainability challenges.",
      "This course introduces students to quantitative methods in the social sciences, with a focus on information systems and business re. Students learn to make valid statistical inferences from data, critique and design quantitative re, and apply business analytics and machine learning techniques to support organizational decision-making.",
      "The course introduces students to the foundations, methods, and practices of Artificial Intelligence within its organizational, social and political contexts. The course combines hands-on exploration of contemporary tools with critical perspectives on their use, equipping students to experiment with the development and use of AI systems and reflect on their broader implications and consequences.",
      "Students will work in groups on a project drawing from AI-based approaches (e.g., LLM finetuning, classification, clustering, or developing an AI-based service) to engage, explore or address a particular organizational or societal concern.",
      "This course introduces students to cutting-edge robotics re and hands-on applications. Over several multi-week modules, students will work with modern robotic systems, learning both theory and practical implementation. Each module covers a specific area of robotics re, combining lectures with hands-on projects that let students apply what they've learned. The course emphasizes practical problem-solving and real-world applications of robotics technology.",
      "In today's world of professional software development, ensuring your code works perfectly is not just a final step--it is an ongoing process. As systems become more complex, developers need more than just intuition and manual checks. They need systematic ways to test and analyze programs to catch bugs and validate behavior. This course is all about giving you the tools, techniques and hands-on experience to just do that.",
      "In this course, we teach advanced machine learning (ML) techniques and hands-on skills for applying these techniques to natural language processing (NLP) problems.",
      "This course introduces advanced machine learning techniques with a focus on the visual domain, emphasizing their role in both re and real-world applications. Students will gain practical skills through hands-on exercises to support theoretical understanding. We aim to enabling them to choose and adapt appropriate methods for specific tasks. In the age of generative AI, understanding the underlying principles is essential. The course contributes to developing AI literacy by introducing foundational concepts, diving into selected technical details, and fostering critical discussions around the capabilities and limitations of current approaches.",
      "In this course, you will learn different aspects of modern data systems, in particular state-of-the-art data mangement techniques that have been used or proposed in industry and academia.",
      "Learn how to analyze software systems to ensure they meet security policies under specific trust assumptions. This course covers topics such as information flow, declassification, non-interference, timing attacks, and program analysis tools, with a focus on reasoning about program behavior and securing data flows.",
      "This course focuses on using real-world data for protecting data and systems from cyberattacks. The course will be divided into two main thematic parts: cyber threat intelligence, which focuses on methods on using information about past cyberattacks and known attacker groups, and empirical re in human factors in security, focusing on studying human behavior in security-critical systems. The course is aimed at students with a background in computer science/data science with basic knowledge of cybersecurity.",
      "This course considers the nature as well as the challenges associated with ‘global project management and IT’.",
      "This is an introductory course on information security. The course focuses on introductory aspects of analysis, design and implementation of secure software.",
      "The course is an introduction to software engineering and software development for data science. The goal of the course is to allow students to join professional software engineering teams that include data scientist and data analysts.",
      "Revideret kursus for BDDIT 2024. Erstatningskursus for tidligere BDDIT optag",
      "Formålet med kurset er at give de studerende en grundlæggende forståelse for kvantitative metoder og deres anvendelse i både forskning og designpraksis.",
      "New Special Topic / Specialisation course for KDDIT 2024",
      "This course draws on theories and methods from Human Computer Interaction and Interaction Design and enhances students’ ability to critically analyze, understand and develop interactive technologies through hands-on experiments in a studio workspace.",
      "New Special Topic / Specialisation for KDDIT 2024",
      "AI-driven products are reshaping industries as well as our everyday lives, yet many fail due to poor user experience. This course equips designers with the theories, methods, and toolkits to work with AI/ML as a design material. Through project-based learning, students will gain experience with user re and design methods in the context of AI- driven products (e.g., personalized services, virtual assistants, generative AI).",
      "Contemporary organizations critically rely on enterprise systems and digital platforms to support and transform their business processes. In this course, students learn to analyze work systems within organizations and to identify ways for improving them. Students acquire these skills by analyzing a real-world work system and by gaining hands-on experience suggesting requirements for a sociotechnical system that supports the work system.",
      "The course will teach students to analyse complexity within an empirical case that explores a current topic within the fields of science, technology, and innovation.",
      "This is a course in mathematics covering linear algebra and analysis (calculus) of functions of several variables. These are perhaps the two areas of mathematics that have found most uses in practical applications. In particular, the course equips the student with mathematical tools necessary for analysis of big data.",
      "This hands-on course teaches you how the design, implementation, and implications, of computer systems influence your task as an application programmer. You will get an in-depth understanding of how hardware and the operating system work; in the process, you will learn how computers actually work, and what actually happens at the lowest level when you run an application. This enables you to fully exploit underlying hardware and systems software to write high-quality software.",
      "Discrete Mathematics covers different topics in mathematics, which support many disciplines in software development. The goal of this course is to give the students the ability to apply formal reasoning. The first part of the course is dedicated to learning how to construct logical proofs, proofs on set theory and proofs by induction, while the second half of the course builds upon the first part to cover number-theoretical concepts, graphs, combinatorics, discrete probabilities, and models of computation. The student will obtain the fundamental skill of computational thinking and will be better equipped to tackle technical subjects throughout the curriculum. The course is an introduction to discrete mathematics as a foundation to work within the fields of computer science, information technologies, and software development. The course develops the necessary terminology and conceptual tools needed for later courses.",
      "This course will introduce students to techniques for solving complex programming tasks arising in modern IT systems. The focus in the course is on algorithm design and analysis.",
      "This course addresses advanced programming techniques, with a special attention on functional programming and its applications. The course is a perfect balance of theory and practice, with focus on the Scala programming language.",
      "The course is designed to enable the student to engage with future developments in software engineering by providing a forum for the critical discussion of processes, methods, tools, and architectures. By combining theoretical insights from state-of-the-art re and hands-on experience with advanced tools and techniques, students gain a comprehensive understanding of software engineering.",
      "This course is an advanced course on algorithms which builds on top of an introductory course on algorithms and data structures. The course focuses on advanced techniques for identifying and solving computationally hard problems and on how to adapt such techniques to real-world scenarios.",
      "This course is about that part of programming that focuses on parallelism and concurrency. It covers concurrency concepts that are universal to any programming language. The Java programming language is the main language used for practically addressing such aspects; and Erlang is also used for a topic in the course.",
      "This course introduces key concepts from computing and provides critical and analytical skills for students to engage with a range of computational formats, artifacts, and genres of technical communication. The course enables students to navigate complex technical challenges and meaningfully participate in debates regarding the management of IT. Students learn to understand technical challenges in computing within in organizational, historical, and cultural context. The course is at an introductory level and is well-suited for students with limited or no technical background.",
      "The goal of the course is to address the complex entanglements of IT, innovation and society.",
      "This course introduces students to the foundations of handling heterogeneous data sources through the steps of data collection, annotation, processing, cleaning, integration, transformation, and visualization. Ethical issues and dataset bias are also discussed.",
      "This course gives an introduction to the field of data mining. The course is relatively practically oriented, focusing on applicable algorithms. Practical exercises will involve both use of a freely available data mining package and individual implementation of algorithms.",
      "In this course students will learn to apply modern state-of-the-art solutions for natural language processing problems. We go beyond simple classification tasks, and tackle more advanced types of tasks, like generation and structured prediction.",
      "Networks are all around us: We are ourselves, as individuals, the units of a network of social relationships of different kinds; the Internet and the highway system can be modelled as networks embedded in space; networks can be also entities defined in an abstract space, such as networks of acquaintances or collaborations between individuals. This course aims at providing the computational tools to study these networks and form an advanced understanding of the current state of the art of network science. The final objective is to have the students master computational techniques to solve advanced network problems, to be able to contribute to the development of network analysis, and to appreciate the limitations and future developments of scientific papers dealing with network problems in real-world data.",
      "Kursets formål er at give en dybere praktisk og teoretisk forståelse for implementation af programmeringssprog, herunder især maskinmodellen bag Java, C# og F#. Kursusemnerne omfatter leksikalsk analyse, grammatikker, syntaksanalyse, abstrakt syntaks, stakmaskiner, virtuelle maskiner, mellemkodesprog (inklusive JVM og .NET CLI), og continuations. Endvidere implementering af fortolkere, typeinferens, oversættere for en delmængde af C og for en delmængde af SML, garbage collectors, og kodegenerering for virtuelle maskiner og maskinkode (fx x86).",
      "The course is an introductory course to machine learning its mathematical foundation.",
      "This hands-on course teaches you how the design, implementation, and implications, of computer systems influence your task as an application programmer. You will get an in-depth understanding of how hardware and the operating system work; in the process, you will learn how computers actually work, and what actually happens at the lowest level when you run an application. This enables you to fully exploit underlying hardware and systems software to write high-quality software.",
      "Today we rarely use programs that are developed to fit one specific customer. When we play games, use business systems for administration, or download apps to our phones, we use software that is part of software ecosystems: software products that are configured to fit a specific business context; platforms like game engines that allow the development and sharing of software; or software as a service. Examples of software ecosystems have developed around software products, like game engines, or enterprise resource planning (ERP or CRM) software, integrated development environments like visual studio and platforms like the Android operating system.",
      "In this course you explore software ecosystems from UX design, organizational and technical perspectives. To this end you will analyse a software ecosystem together, propose an improvement related to the ecosystem, and support your proposal with a prototype and / or other design artefacts.",
      "This course enables students to understand the effects of automated digital systems on the way a welfare society is governed and experienced by social groups and individuals.",
      "The course aims at giving the students an introduction to the complexities of determining how processes of digitalisation and green transitions are entangled.",
      "The course aims at giving the students an introduction to the complexities of determining how processes of digitalisation and green transitions are entangled.",
      "Students attending this course will study how to design game code that is scalable and takes into account hardware and software resources.",
      "This course introduces fundamental and advanced concepts in statistics and probability from a data-science perspective. The aim of the course is for the student to be familiarised with probabilistic and statistical methods that are widely used in data analysis.",
      "This course examines organizations in light of contemporary challenges with digitalization. It explores organizational perspectives on digitalization and cover theories that can help us better understand, and critically reflect upon, such profound challenges, while also offering hands-on approaches to managing them. Furthermore, it investigates questions of the changing nature of work, and themes such as leadership, management, and organizing in order to make students both knowledgeable about, and skilled in the practice of, and engaging with, digital transformation.",
      "The course gives an in-depth introduction to fundamental principles of probability theory.",
      "The course aims to teach the understanding, design, implementation, and use of state-of-the-art artificial intelligence (AI) techniques applied to games and other simulation environments. We mainly cover methods to control agents (NPC, bots, robots, etc.), focusing on neural network-based approaches but also tree  techniques such as MCTS. Additionally, this course covers generative AI methods and their use for environment/game level generation, in addition to exploring the use of Large Language Models for games.",
      "The course is for students looking for an introduction to strategic management to be able to understand and navigate todays and tomorrows business world.The student will be given a toolbox of academic frameworks and models to be able to analyze current business situations and propose strategic changes. Through case studies and group work the student will become familiar with the business language which will help to bridge the gap between business and technology.",
      "The overall aim of the course is to enable students to understand and analyse relations between society and technology.",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
      "How to devise a methodology to design experiments so that you can investigate the system’s performance,",
      "The toolset to run the necessary experiments and collect the results, and",
      "At least a basic understanding of the systems layers (hardware, operating systems, etc.) to be able to interpret your results and come up with solutions.",
      "formal reasoning, proofs, logic, set theory, sequences and sums",
      "number theory, combinatorics and (discrete) probability theory",
      "induction, recursion and counting",
      "relations and functions",
      "basic graph theory, language theory",
      "theory and models of computation, such as finite state machines, regular expressions and grammars"
    ],
    "links": [],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Course list How to find and choose courses Courses open for exchange students Exchange students can choose courses across different study programmes at ITU, but only courses at their own level of studies. BSc students can only register for BSc courses and MSc students can only register for MSc courses. See the course description for each course for possible formal prerequisites. Please notice, the full course descriptions for Spring 2026 will not be published until November 15. Full list of courses and basic course information, such as abstract and learning outcomes, will be available from September 15, but can be subject to change. For course descriptions from previous semesters, please go ITU's Course Catalogue. In this course, you will learn how to analyze and improve the performance of a computer system with a specific focus on data-intensive systems. To investigate a system’s performance and come up with solutions to improve it, there are three key things to know. This is what we will cover in this course. The subject of the course is functional, declarative programming in general and F# in particular. This course gives an introduction to IoT as well as practical experience with the design and implementation of end-to-end IoT systems. Practical examples and exercises will predominatly be from domains Energy and Environment. This course introduces mobile app design and development using Kotlin and Jetpack Compose for the Android platform, with a focus on concurrency and modern architectural patterns. This course gives a fundamental overview of Android programming concepts and the best practices for mobile app development. The course \"DevOps, Software Evolution and Software Maintenance\" is a BSc elective. In this course, the students will discover all the software engineering activities that take place after an initial software product is delivered or after a legacy system is taken over from a theoretical and practical perspective. Students (in groups) will take over such a system that is live and serving users, they will refactor and migrate it to the languages and technologies of their liking. All subsequent DevOps, software evolution and software maintenance activities will be performed directly on the systems of the students. All use of generative artificial intelligence is allowed during the exam, as long as the student follows the official ITU guidelines on generative artificial intelligence. The course \"DevOps, Software Evolution and Software Maintenance\" is an MSc elective. In this course, the students will discover all the software engineering activities that take place after an initial software product is delivered or after a legacy system is taken over from a theoretical and practical perspective. Students (in groups) will take over such a system that is live and serving users, they will refactor and migrate it to the languages and technologies of their liking. All subsequent DevOps, software evolution and software maintenance activities will be performed directly on the systems of the students. This is a hands-on course that teaches you how to prove that programs are correct. You will get in-depth experience with tools for this task, as well as an understanding of the theory behind them. This course thus equips you to pursue a career in writing safety-critical systems, or in pursuing higher studies in this area. This is a hands-on course that teaches you how to prove that programs are correct. You will get in-depth experience with tools for this task, as well as an understanding of the theory behind them. This course thus equips you to pursue a career in writing safety-critical systems, or in pursuing higher studies in this area. Algorithmic problem solving is the art of designing algorithms to solve challenging programming problems. This requires extensive practice in classifying problems, choosing the right data structures, and identifying suitable algorithms. This is very different to a standard algorithm and data structure course, where the focus is on understanding the tools at hand, but not on using them to solve problems. This course bridges the gap between theoretical knowledge and practical solutions to computational problems. This course introduces the basic concepts of modern cryptography. The main focus is on provable security: mathematically defining security goals and proving that cryptographic algorithms fulfill such definitions under a set of assumptions. The course will cover how to formally define the confidentiality and integrity guarantees provided by fundamental private-key and public-key cryptographic primitives, as well as how to prove that popular algorithms achieve these guarantees. The course gives an in-depth introduction to the fundamental principles of statistics. The course addresses the process of datafication through the lenses of data visualization. Datafication is pervasive in contemporary society, presenting both challenges and opportunities for individuals and communities. However, it is neither a neutral nor a natural process. It occurs within specific sociotechnical systems, shaping and being shaped by their contexts, and has profound, far-reaching implications The course will explore this process dealing with the most urgent issues such as bias in data and data fairness and then, building of the critical understanding of data processes, it will introduce the key elements of practical data visualization. Dette kursus introducerer teorier og metoder knyttet til innovation med særligt fokus på produkter, services og systemer, der relaterer til eller involverer digitale teknologier. Kurset involverer fordybelse i forskellige typer innovationsprocesses, forståelse af organisationer som kontekst for innovation og indsigter i muligheder for innovation, innovationsstrategier og konkurrentanalyse. Gennem et case-baseret engagement med eksterne virksomhederr og organisationer vil de studerende formulere, afprøve og præsentere konkrete konceptforslag til innovation og argumentere for deres relevans for samarbejdspartneren. Kurset vil introducere og lære de studerende til Physical Computing, herunder udforske input- og output-modaliteter i interaktioner mellem menneske og maskine, der rækker ud over skærme, tastaturer og mus. Kurset vil lære de studerende de grundlæggende koncepter inden for elektronik og hvordan man arbejder med en mikrokontroller, f.eks. Arduino-platformen. New mandatory course for BDDIT 2026. Redesigned version of Philosophy of Science and Technology, DMD/B-DDIT (last offered Autumn 2024). The course provides a basic introduction to philosophical and ethical problems related to digital design. The course puts a special focus on digitality, exploring its foundations, ontology, and ethical implications. This course will introduce classes of tasks that are at the core of most real-world production systems. It will teach advanced solutions to solve these tasks on complex and large-scale data with state-of-the-art tools. This course addresses programming techniques with a focus on advanced type systems such as ownership types in Rust. The course combines practical programming experience with theoretical foundations in type systems and memory management. The course \"IT Program Management\" is a one semester 7.5 ECTS MSc elective in the MSc Computer Science program. The course focuses on program management theory and methods, key concepts, common re approaches, and case studies of IT programs. The course covers themes such as pitfalls of program management, IT program success and failure, and software engineering concepts including the software development life cycle and software development methodologies. In this course, we teach both advanced machine learning (ML) approaches and hands-on skills for applying these approaches to data science and computer science problems. This course examines the ethical contexts of data as socio-political phenomena. In highlighting the various ethical dilemmas that can arise in data saturated worlds, the course encourages students to contextualize, critique, and reflect upon how data are generated, for whom, and to what effects. It guides students in this endeavor by adopting a critical data studies approach focused on analyzing the structural conditions through which data emerge and have serious effects on the world. The course supports students in conducting an ethical analysis of a contemporary data dilemma arising within the public and private sectors. This course introduces students to business process improvement and automation, combining classic approaches such as Lean and Business Process Reengineering with emerging technologies like low-code automation, RPA, and generative AI. Through hands-on exercises and an industry project, students learn to model, analyze, improve, and automate processes while addressing implementation, governance, and sustainability challenges. This course introduces students to quantitative methods in the social sciences, with a focus on information systems and business re. Students learn to make valid statistical inferences from data, critique and design quantitative re, and apply business analytics and machine learning techniques to support organizational decision-making. The course introduces students to the foundations, methods, and practices of Artificial Intelligence within its organizational, social and political contexts. The course combines hands-on exploration of contemporary tools with critical perspectives on their use, equipping students to experiment with the development and use of AI systems and reflect on their broader implications and consequences. Students will work in groups on a project drawing from AI-based approaches (e.g., LLM finetuning, classification, clustering, or developing an AI-based service) to engage, explore or address a particular organizational or societal concern. This course introduces students to cutting-edge robotics re and hands-on applications. Over several multi-week modules, students will work with modern robotic systems, learning both theory and practical implementation. Each module covers a specific area of robotics re, combining lectures with hands-on projects that let students apply what they've learned. The course emphasizes practical problem-solving and real-world applications of robotics technology. In today's world of professional software development, ensuring your code works perfectly is not just a final step--it is an ongoing process. As systems become more complex, developers need more than just intuition and manual checks. They need systematic ways to test and analyze programs to catch bugs and validate behavior. This course is all about giving you the tools, techniques and hands-on experience to just do that. In this course, we teach advanced machine learning (ML) techniques and hands-on skills for applying these techniques to natural language processing (NLP) problems. This course introduces advanced machine learning techniques with a focus on the visual domain, emphasizing their role in both re and real-world applications. Students will gain practical skills through hands-on exercises to support theoretical understanding. We aim to enabling them to choose and adapt appropriate methods for specific tasks. In the age of generative AI, understanding the underlying principles is essential. The course contributes to developing AI literacy by introducing foundational concepts, diving into selected technical details, and fostering critical discussions around the capabilities and limitations of current approaches. In this course, you will learn different aspects of modern data systems, in particular state-of-the-art data mangement techniques that have been used or proposed in industry and academia. Learn how to analyze software systems to ensure they meet security policies under specific trust assumptions. This course covers topics such as information flow, declassification, non-interference, timing attacks, and program analysis tools, with a focus on reasoning about program behavior and securing data flows. This course focuses on using real-world data for protecting data and systems from cyberattacks. The course will be divided into two main thematic parts: cyber threat intelligence, which focuses on methods on using information about past cyberattacks and known attacker groups, and empirical re in human factors in security, focusing on studying human behavior in security-critical systems. The course is aimed at students with a background in computer science/data science with basic knowledge of cybersecurity. This course considers the nature as well as the challenges associated with ‘global project management and IT’. This is an introductory course on information security. The course focuses on introductory aspects of analysis, design and implementation of secure software. The course is an introduction to software engineering and software development for data science. The goal of the course is to allow students to join professional software engineering teams that include data scientist and data analysts. Revideret kursus for BDDIT 2024. Erstatningskursus for tidligere BDDIT optag Formålet med kurset er at give de studerende en grundlæggende forståelse for kvantitative metoder og deres anvendelse i både forskning og designpraksis. New Special Topic / Specialisation course for KDDIT 2024 This course draws on theories and methods from Human Computer Interaction and Interaction Design and enhances students’ ability to critically analyze, understand and develop interactive technologies through hands-on experiments in a studio workspace. New Special Topic / Specialisation for KDDIT 2024 AI-driven products are reshaping industries as well as our everyday lives, yet many fail due to poor user experience. This course equips designers with the theories, methods, and toolkits to work with AI/ML as a design material. Through project-based learning, students will gain experience with user re and design methods in the context of AI- driven products (e.g., personalized services, virtual assistants, generative AI). Contemporary organizations critically rely on enterprise systems and digital platforms to support and transform their business processes. In this course, students learn to analyze work systems within organizations and to identify ways for improving them. Students acquire these skills by analyzing a real-world work system and by gaining hands-on experience suggesting requirements for a sociotechnical system that supports the work system. The course will teach students to analyse complexity within an empirical case that explores a current topic within the fields of science, technology, and innovation. This is a course in mathematics covering linear algebra and analysis (calculus) of functions of several variables. These are perhaps the two areas of mathematics that have found most uses in practical applications. In particular, the course equips the student with mathematical tools necessary for analysis of big data. This hands-on course teaches you how the design, implementation, and implications, of computer systems influence your task as an application programmer. You will get an in-depth understanding of how hardware and the operating system work; in the process, you will learn how computers actually work, and what actually happens at the lowest level when you run an application. This enables you to fully exploit underlying hardware and systems software to write high-quality software. Discrete Mathematics covers different topics in mathematics, which support many disciplines in software development. The goal of this course is to give the students the ability to apply formal reasoning. The first part of the course is dedicated to learning how to construct logical proofs, proofs on set theory and proofs by induction, while the second half of the course builds upon the first part to cover number-theoretical concepts, graphs, combinatorics, discrete probabilities, and models of computation. The student will obtain the fundamental skill of computational thinking and will be better equipped to tackle technical subjects throughout the curriculum. The course is an introduction to discrete mathematics as a foundation to work within the fields of computer science, information technologies, and software development. The course develops the necessary terminology and conceptual tools needed for later courses. This course will introduce students to techniques for solving complex programming tasks arising in modern IT systems. The focus in the course is on algorithm design and analysis. This course addresses advanced programming techniques, with a special attention on functional programming and its applications. The course is a perfect balance of theory and practice, with focus on the Scala programming language. The course is designed to enable the student to engage with future developments in software engineering by providing a forum for the critical discussion of processes, methods, tools, and architectures. By combining theoretical insights from state-of-the-art re and hands-on experience with advanced tools and techniques, students gain a comprehensive understanding of software engineering. This course is an advanced course on algorithms which builds on top of an introductory course on algorithms and data structures. The course focuses on advanced techniques for identifying and solving computationally hard problems and on how to adapt such techniques to real-world scenarios. This course is about that part of programming that focuses on parallelism and concurrency. It covers concurrency concepts that are universal to any programming language. The Java programming language is the main language used for practically addressing such aspects; and Erlang is also used for a topic in the course. This course introduces key concepts from computing and provides critical and analytical skills for students to engage with a range of computational formats, artifacts, and genres of technical communication. The course enables students to navigate complex technical challenges and meaningfully participate in debates regarding the management of IT. Students learn to understand technical challenges in computing within in organizational, historical, and cultural context. The course is at an introductory level and is well-suited for students with limited or no technical background. The goal of the course is to address the complex entanglements of IT, innovation and society. This course introduces students to the foundations of handling heterogeneous data sources through the steps of data collection, annotation, processing, cleaning, integration, transformation, and visualization. Ethical issues and dataset bias are also discussed. This course gives an introduction to the field of data mining. The course is relatively practically oriented, focusing on applicable algorithms. Practical exercises will involve both use of a freely available data mining package and individual implementation of algorithms. In this course students will learn to apply modern state-of-the-art solutions for natural language processing problems. We go beyond simple classification tasks, and tackle more advanced types of tasks, like generation and structured prediction. Networks are all around us: We are ourselves, as individuals, the units of a network of social relationships of different kinds; the Internet and the highway system can be modelled as networks embedded in space; networks can be also entities defined in an abstract space, such as networks of acquaintances or collaborations between individuals. This course aims at providing the computational tools to study these networks and form an advanced understanding of the current state of the art of network science. The final objective is to have the students master computational techniques to solve advanced network problems, to be able to contribute to the development of network analysis, and to appreciate the limitations and future developments of scientific papers dealing with network problems in real-world data. Kursets formål er at give en dybere praktisk og teoretisk forståelse for implementation af programmeringssprog, herunder især maskinmodellen bag Java, C# og F#. Kursusemnerne omfatter leksikalsk analyse, grammatikker, syntaksanalyse, abstrakt syntaks, stakmaskiner, virtuelle maskiner, mellemkodesprog (inklusive JVM og .NET CLI), og continuations. Endvidere implementering af fortolkere, typeinferens, oversættere for en delmængde af C og for en delmængde af SML, garbage collectors, og kodegenerering for virtuelle maskiner og maskinkode (fx x86). The course is an introductory course to machine learning its mathematical foundation. This hands-on course teaches you how the design, implementation, and implications, of computer systems influence your task as an application programmer. You will get an in-depth understanding of how hardware and the operating system work; in the process, you will learn how computers actually work, and what actually happens at the lowest level when you run an application. This enables you to fully exploit underlying hardware and systems software to write high-quality software. Today we rarely use programs that are developed to fit one specific customer. When we play games, use business systems for administration, or download apps to our phones, we use software that is part of software ecosystems: software products that are configured to fit a specific business context; platforms like game engines that allow the development and sharing of software; or software as a service. Examples of software ecosystems have developed around software products, like game engines, or enterprise resource planning (ERP or CRM) software, integrated development environments like visual studio and platforms like the Android operating system. In this course you explore software ecosystems from UX design, organizational and technical perspectives. To this end you will analyse a software ecosystem together, propose an improvement related to the ecosystem, and support your proposal with a prototype and / or other design artefacts. This course enables students to understand the effects of automated digital systems on the way a welfare society is governed and experienced by social groups and individuals. The course aims at giving the students an introduction to the complexities of determining how processes of digitalisation and green transitions are entangled. The course aims at giving the students an introduction to the complexities of determining how processes of digitalisation and green transitions are entangled. Students attending this course will study how to design game code that is scalable and takes into account hardware and software resources. This course introduces fundamental and advanced concepts in statistics and probability from a data-science perspective. The aim of the course is for the student to be familiarised with probabilistic and statistical methods that are widely used in data analysis. This course examines organizations in light of contemporary challenges with digitalization. It explores organizational perspectives on digitalization and cover theories that can help us better understand, and critically reflect upon, such profound challenges, while also offering hands-on approaches to managing them. Furthermore, it investigates questions of the changing nature of work, and themes such as leadership, management, and organizing in order to make students both knowledgeable about, and skilled in the practice of, and engaging with, digital transformation. The course gives an in-depth introduction to fundamental principles of probability theory. The course aims to teach the understanding, design, implementation, and use of state-of-the-art artificial intelligence (AI) techniques applied to games and other simulation environments. We mainly cover methods to control agents (NPC, bots, robots, etc.), focusing on neural network-based approaches but also tree techniques such as MCTS. Additionally, this course covers generative AI methods and their use for environment/game level generation, in addition to exploring the use of Large Language Models for games. The course is for students looking for an introduction to strategic management to be able to understand and navigate todays and tomorrows business world.The student will be given a toolbox of academic frameworks and models to be able to analyze current business situations and propose strategic changes. Through case studies and group work the student will become familiar with the business language which will help to bridge the gap between business and technology. The overall aim of the course is to enable students to understand and analyse relations between society and technology. This page is printed from https://www.itu.dk/om-itu/bygning/find-vej How to devise a methodology to design experiments so that you can investigate the system’s performance, The toolset to run the necessary experiments and collect the results, and At least a basic understanding of the systems layers (hardware, operating systems, etc.) to be able to interpret your results and come up with solutions. formal reasoning, proofs, logic, set theory, sequences and sums number theory, combinatorics and (discrete) probability theory induction, recursion and counting relations and functions basic graph theory, language theory theory and models of computation, such as finite state machines, regular expressions and grammars",
    "word_count": 3725
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/How-to-apply-to-become-exchange-student#main",
    "title": "How to apply",
    "headings": [
      {
        "level": "h1",
        "text": "How to apply"
      },
      {
        "level": "h2",
        "text": "On this page you find the information necessary to apply to become an exchange student at ITU"
      },
      {
        "level": "h2",
        "text": "Application step by step"
      },
      {
        "level": "h2",
        "text": "English language proficiency requirement"
      }
    ],
    "paragraphs": [
      "Application deadlinesAutumn semester - end of August to Januar Nomination deadline: 15 April Application deadline: 1 May Spring semester - end of January to June Nomination deadline: 15 October Application deadline: 1 November Summer University - July to August Nomination deadline: 1 April Application deadline: 15 April You have to prepare the following application documents for your exchange application:",
      "Autumn semester - end of August to Januar",
      "Nomination deadline: 15 April Application deadline: 1 May",
      "Spring semester - end of January to June",
      "Nomination deadline: 15 October Application deadline: 1 November",
      "Summer University - July to August",
      "Nomination deadline: 1 April Application deadline: 15 April",
      "How to meet and document the English language proficiency requirement:",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
      "ITU pre-approval of credit transfer",
      "Online Learning Agreement (for Erasmus+ students only)",
      "Transcript of records (incl. BSc diploma if you apply for MSc courses)",
      "Documentation for English language proficiency",
      "Scan of passport (photo page)",
      "Your home university sends us your nomination (we need your name, email address, date of birth (dd-mm-yyyy), gender, citizenship and level of studies: BSc/MSc)",
      "We start up your application in our application portal and guide you on how to apply via the system",
      "You apply within the application deadline",
      "We confirm your application",
      "You receive a Letter of Acceptance including information about the Introduction Day, course registration, housing and residence permit (for non EU-citizens)",
      "We inform you about result of your course selection",
      "You receive a welcoming email with information about your study start",
      "Finally we welcome you on the Introduction Day at ITU",
      "You hold an upper secondary school certificate or a BSc degree that has been fully taught in English from USA, Canada, Australia, New Zealand, England, Scotland or Ireland",
      "You are enrolled in BSc or MSc degree fully taught in English",
      "You are a native speaker of English",
      "For ERASMUS students only: You have achieved the minimum result of B2 in the Online Linguistic Support (OLS)",
      "You have achieved the minimum result in one of the following English language proficiency tests: IELTS Academic Test: minimum result of 6.5 TOEFL iBT: minimum result of 88 Cambridge Certificate of Advanced English (CAE): passed Cambridge Certificate of Proficiency in English (CPE): passed NB: The test result cannot be more than 2 years old (please note, time limitation does not apply to CPE and CAE).",
      "IELTS Academic Test: minimum result of 6.5",
      "TOEFL iBT: minimum result of 88",
      "Cambridge Certificate of Advanced English (CAE): passed",
      "Cambridge Certificate of Proficiency in English (CPE): passed",
      "NB: The test result cannot be more than 2 years old (please note, time limitation does not apply to CPE and CAE)."
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students",
        "text": "Exchange students"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "Exchange student at IT-University of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/Preapproval-of-credit-transfer--151118-pdf.pdf",
        "text": "ITU pre-approval of credit transfer"
      }
    ],
    "metadata": {
      "description": "On this page you find the information necessary to apply to become an exchange student at ITU"
    },
    "full_text": "How to apply How to apply On this page you find the information necessary to apply to become an exchange student at ITU Application step by step English language proficiency requirement Application deadlinesAutumn semester - end of August to Januar Nomination deadline: 15 April Application deadline: 1 May Spring semester - end of January to June Nomination deadline: 15 October Application deadline: 1 November Summer University - July to August Nomination deadline: 1 April Application deadline: 15 April You have to prepare the following application documents for your exchange application: Autumn semester - end of August to Januar Nomination deadline: 15 April Application deadline: 1 May Spring semester - end of January to June Nomination deadline: 15 October Application deadline: 1 November Summer University - July to August Nomination deadline: 1 April Application deadline: 15 April How to meet and document the English language proficiency requirement: This page is printed from https://www.itu.dk/om-itu/bygning/find-vej ITU pre-approval of credit transfer Online Learning Agreement (for Erasmus+ students only) Transcript of records (incl. BSc diploma if you apply for MSc courses) Documentation for English language proficiency Scan of passport (photo page) Your home university sends us your nomination (we need your name, email address, date of birth (dd-mm-yyyy), gender, citizenship and level of studies: BSc/MSc) We start up your application in our application portal and guide you on how to apply via the system You apply within the application deadline We confirm your application You receive a Letter of Acceptance including information about the Introduction Day, course registration, housing and residence permit (for non EU-citizens) We inform you about result of your course selection You receive a welcoming email with information about your study start Finally we welcome you on the Introduction Day at ITU You hold an upper secondary school certificate or a BSc degree that has been fully taught in English from USA, Canada, Australia, New Zealand, England, Scotland or Ireland You are enrolled in BSc or MSc degree fully taught in English You are a native speaker of English For ERASMUS students only: You have achieved the minimum result of B2 in the Online Linguistic Support (OLS) You have achieved the minimum result in one of the following English language proficiency tests: IELTS Academic Test: minimum result of 6.5 TOEFL iBT: minimum result of 88 Cambridge Certificate of Advanced English (CAE): passed Cambridge Certificate of Proficiency in English (CPE): passed NB: The test result cannot be more than 2 years old (please note, time limitation does not apply to CPE and CAE). IELTS Academic Test: minimum result of 6.5 TOEFL iBT: minimum result of 88 Cambridge Certificate of Advanced English (CAE): passed Cambridge Certificate of Proficiency in English (CPE): passed NB: The test result cannot be more than 2 years old (please note, time limitation does not apply to CPE and CAE).",
    "word_count": 470
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students#main",
    "title": "Exchange students",
    "headings": [
      {
        "level": "h1",
        "text": "Exchange students"
      },
      {
        "level": "h2",
        "text": "Exchange student at IT-University of Copenhagen"
      }
    ],
    "paragraphs": [
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej"
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "Exchange student at IT-University of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "READ MORE"
      }
    ],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Exchange students Exchange students Exchange student at IT-University of Copenhagen This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
    "word_count": 16
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
    "title": "Exchange student at IT-University of Copenhagen",
    "headings": [
      {
        "level": "h1",
        "text": "Exchange Students"
      },
      {
        "level": "h2",
        "text": "Why do an exchange at ITU"
      },
      {
        "level": "h2",
        "text": "Summer university courses"
      },
      {
        "level": "h2",
        "text": "Free Mover"
      },
      {
        "level": "h2",
        "text": "Erasmus documents"
      },
      {
        "level": "h2",
        "text": "Follow @itustudent on  and meet more ITU students"
      },
      {
        "level": "h3",
        "text": "How to become an exchange student"
      },
      {
        "level": "h3",
        "text": "Academic calender"
      },
      {
        "level": "h3",
        "text": "Become a free mover at ITU"
      },
      {
        "level": "h3",
        "text": "Apply for admission"
      }
    ],
    "paragraphs": [
      "As an exchange student the IT University of Copenhagen, you'll find a mix of lectures, hands-on exercises, and group projects that help you engage with real-world challenges. Our re-driven programmes are regularly updated in collaboration with industry, so the skills you develop are relevant and valued in today’s job market.",
      "During your exchange stay at ITU, you’ll have the chance to build practical knowledge and connect with opportunities that can support your future career.",
      "The IT University welcomes exchange students from our partner universities from all over the world each year to study one or two semesters or during the summer with us. To be an exchange student at the IT University, your home university has to have an Erasmus+ or bilateral partnership agreement with us.",
      "You can see the list of IT University partner universities, if you expand the paragraph below. If your university is not listed, please  your university regarding cooperation opportunities with us. Moreover, it is possible to become a free mover at the IT University (read more about free mover at the bottom of this page).",
      "To become an exchange student your home university needs to officially nominate you before you can apply to us. After being nominated, we will guide you in the application process.",
      "Autumn: The academic semester starts Monday in week 35. The Intro Day for exchange students take place Thursday or Friday in week 34. The teaching runs for 14 weeks and the exams are held in December/January. The re-exams are held in February (re-submission)/March. Spring: The academic semester starts Monday in week 5. The Intro Day for exchange students takes place Thursday or Friday in week 4. The teaching runs for 14 weeks and the exams are held in May/June. The re-exams are held in July (re-submission)/August. Summer: The teaching takes place in week 28-31. The exams are held in week 32 and the re-exams in week 34.",
      "ITU Summer University consists of several summer courses taught at the IT University of Copenhagen during July and August. The summer courses are taught by ITU’s teaching staff as well as by guest lecturers/teachers. As an exchange student you can take one of these summer courses together with students from the ITU.",
      "See the Summer University courses in the course catalogue for exchange students in the \"Find courses\" box. Please note, you can register for one course of 7.5 ECTS on your own programme level only.",
      "If your home university does not have an Erasmus+ or bilateral partnership agreement with the IT University, you can become a free mover at ITU. As a free mover, you have to pay tuition fee for the courses at the IT University.",
      "Please note that if you are a non-EU/EEA citizen, you need a residence permit in Denmark to apply as a free mover.",
      "You apply for admission via the application portal for ‘Single subjects’. You will find tuition fees, deadlines and the link to the application portal here. In the application system, you must choose ‘Student Place Vacancy’ as the type of education. If you have any questions, please  ITU Professional Education at professionaleducation@itu.dk",
      "The IT University of Copenhagen is an innovative, globally active university that focuses on carrying out teaching and re of the highest quality for attracting and providing the world with talent, who can make a difference in the world of today and tomorrow.",
      "In support of this, the IT University engages in bilateral partnerships and the Erasmus+ programme for knowledge-sharing and the exchange of students and staff.",
      "Read the Erasmus Policy Statement By The IT University Of Copenhagen",
      "Read the ITU Erasmus policy (UK)",
      "Read the Erasmus charter",
      "If you have any questions, please  Student Affairs and Programmes at sap@itu.dk",
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej"
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Course-list",
        "text": "Find courses"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/How-to-apply-to-become-exchange-student",
        "text": "How to apply"
      },
      {
        "url": "https://en.itu.dk/Programmes/Student-Life/Practical-information-for-international-students",
        "text": "Practical information"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Factsheet-and-partner-universities",
        "text": "Factsheet & Partner Universities"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU/Erasmus-policy-statement",
        "text": "Read the Erasmus Policy Statement By The IT University Of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/CoC-FINAL-som-på-ufm-dk-EN-pdf.pdf",
        "text": "Read the ITU Erasmus policy (UK)"
      },
      {
        "url": "https://en.itu.dk/-/media/EN/Programmes/Exchange/Ersamus-Charter-ITU_2021-pdf.pdf",
        "text": "Read the Erasmus charter"
      }
    ],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Exchange student at IT-University of Copenhagen Exchange Students Why do an exchange at ITU Summer university courses Free Mover Erasmus documents Follow @itustudent on and meet more ITU students How to become an exchange student Academic calender Become a free mover at ITU Apply for admission As an exchange student the IT University of Copenhagen, you'll find a mix of lectures, hands-on exercises, and group projects that help you engage with real-world challenges. Our re-driven programmes are regularly updated in collaboration with industry, so the skills you develop are relevant and valued in today’s job market. During your exchange stay at ITU, you’ll have the chance to build practical knowledge and connect with opportunities that can support your future career. The IT University welcomes exchange students from our partner universities from all over the world each year to study one or two semesters or during the summer with us. To be an exchange student at the IT University, your home university has to have an Erasmus+ or bilateral partnership agreement with us. You can see the list of IT University partner universities, if you expand the paragraph below. If your university is not listed, please your university regarding cooperation opportunities with us. Moreover, it is possible to become a free mover at the IT University (read more about free mover at the bottom of this page). To become an exchange student your home university needs to officially nominate you before you can apply to us. After being nominated, we will guide you in the application process. Autumn: The academic semester starts Monday in week 35. The Intro Day for exchange students take place Thursday or Friday in week 34. The teaching runs for 14 weeks and the exams are held in December/January. The re-exams are held in February (re-submission)/March. Spring: The academic semester starts Monday in week 5. The Intro Day for exchange students takes place Thursday or Friday in week 4. The teaching runs for 14 weeks and the exams are held in May/June. The re-exams are held in July (re-submission)/August. Summer: The teaching takes place in week 28-31. The exams are held in week 32 and the re-exams in week 34. ITU Summer University consists of several summer courses taught at the IT University of Copenhagen during July and August. The summer courses are taught by ITU’s teaching staff as well as by guest lecturers/teachers. As an exchange student you can take one of these summer courses together with students from the ITU. See the Summer University courses in the course catalogue for exchange students in the \"Find courses\" box. Please note, you can register for one course of 7.5 ECTS on your own programme level only. If your home university does not have an Erasmus+ or bilateral partnership agreement with the IT University, you can become a free mover at ITU. As a free mover, you have to pay tuition fee for the courses at the IT University. Please note that if you are a non-EU/EEA citizen, you need a residence permit in Denmark to apply as a free mover. You apply for admission via the application portal for ‘Single subjects’. You will find tuition fees, deadlines and the link to the application portal here. In the application system, you must choose ‘Student Place Vacancy’ as the type of education. If you have any questions, please ITU Professional Education at professionaleducation@itu.dk The IT University of Copenhagen is an innovative, globally active university that focuses on carrying out teaching and re of the highest quality for attracting and providing the world with talent, who can make a difference in the world of today and tomorrow. In support of this, the IT University engages in bilateral partnerships and the Erasmus+ programme for knowledge-sharing and the exchange of students and staff. Read the Erasmus Policy Statement By The IT University Of Copenhagen Read the ITU Erasmus policy (UK) Read the Erasmus charter If you have any questions, please Student Affairs and Programmes at sap@itu.dk This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
    "word_count": 670
  },
  {
    "url": "https://en.itu.dk/Programmes/Exchange-students",
    "title": "Exchange students",
    "headings": [
      {
        "level": "h1",
        "text": "Exchange students"
      },
      {
        "level": "h2",
        "text": "Exchange student at IT-University of Copenhagen"
      }
    ],
    "paragraphs": [
      "This page is printed from https://www.itu.dk/om-itu/bygning/find-vej"
    ],
    "links": [
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "Exchange student at IT-University of Copenhagen"
      },
      {
        "url": "https://en.itu.dk/Programmes/Exchange-students/Exchange-students-ITU",
        "text": "READ MORE"
      }
    ],
    "metadata": {
      "description": "Study games, digital design, data science, business and software engineering at The IT University of Copenhagen."
    },
    "full_text": "Exchange students Exchange students Exchange student at IT-University of Copenhagen This page is printed from https://www.itu.dk/om-itu/bygning/find-vej",
    "word_count": 16
  }
]